{"meta":{"title":"BRUCE GAME","subtitle":"Bruce Game Studio Official Webstie","description":"Bruce Game Studio Official Webstie","author":"bruce","url":"http://localhost:4000","root":"/"},"pages":[{"title":"Contact US","date":"2019-04-22T14:24:56.000Z","updated":"2019-04-26T09:00:36.564Z","comments":false,"path":"Contact-US/index.html","permalink":"http://localhost:4000/Contact-US/index.html","excerpt":"","text":"QQ：1090952040Email：1090952040@qq.comAddress: Room 1313, Zhongchen International Building, No. 157 Jinzhai South Road, Laoshan District, ChinaPostal code： 230001"},{"title":"PRIVACY POLICY","date":"2019-04-22T14:24:15.000Z","updated":"2019-04-26T09:46:42.928Z","comments":false,"path":"Privacy/index.html","permalink":"http://localhost:4000/Privacy/index.html","excerpt":"","text":"What personal information does the app collect and why?The personal information that we may collect about you through the Services broadly falls into the following categories: when you play our Games or visit our Website, we may collect certain information automatically from your device; this information may be considered personal information under applicable data protection laws. Also from time to time, you may send us personal information voluntarily, for example when you email us for support. Information that we collect automatically in our GamesWe automatically collect certain types of information whenever you interact with our Games, via a 3rd party analytics partner such as Unity, Firebase. This information is stored in our partner’s servers, and visible to us in anonymous, aggregated or pseudonymized form which does not focus on you individually. Specifically, this may include information like your device type, unique device identification numbers, broad geographic location (e.g. country derived from IP address) and technical information such as crash reporting. In addition, we may collect information about your interactions with our Games, such as how long you play for, or whether you’ve encountered any technical glitches. This type of anonymized data enables us to figure out how players use our Games, so we can make improvements to our Games over time, such as fixing bugs or identifying areas of the game which are too difficult. In addition, in some of our free to play games we also partner with mobile advertising networks, such as Mopub, Admob. Each of these companies collect some pseudonymized usage data from players, such as whether or not a player finishes watching an ad all the way through, or whether or not a user clicks on an ad. Personal DataFor purposes of this Privacy Policy, “personal data” means personally identifiable information that specifically identifies you as an individual.Personal information collected by the app is information voluntarily provided to us by you when you create your account or change your account information. The information includes your facebook id, name, gender, location and your friends’id on facebook. the app also stores your game checkins, likes, dislikes, recommendations and messages.The app may use collected personal data for purposes of analyzing usage of the Services, providing customer and technical support, managing and providing Services (including managing advertisement serving) and to further develop the Services and other the app services and products. The app may combine non-personal data with personal data. Please note that certain features of the Services may be able to connect to your social networking sites to obtain additional information about you. In such cases, the app may be able to collect certain information from your social networking profile when your social networking site permits it, and when you consent to allow your social networking site to make that information available to the app. This information may include, but is not limited to, your name, profile picture, gender, user ID, email address, your country, your language, your time zone, the organizations and links on your profile page, the names and profile pictures of your social networking site friends and other information you have included in your social networking site profile. The app may associate and/or combine as well as use information collected by the app and/or obtained through such social networking sites in accordance with this Privacy Policy. Disclosure and Transfer of Personal DataThe app collects and processes personal data on a voluntary basis and it is not in the business of selling your personal data to third parties. Personal data may, however, occasionally be disclosed in accordance with applicable legislation and this Privacy Policy. Additionally, the app may disclose personal data to its parent companies and its subsidiaries in accordance with this Privacy Policy. The app may hire agents and contractors to collect and process personal data on app ’s behalf and in such cases such agents and contractors will be instructed to comply with our Privacy Policy and to use personal data only for the purposes for which the third party has been engaged by the app. These agents and contractors may not use your personal data for their own marketing purposes. The app may use third party service providers such as credit card processors, e-mail service providers, shipping agents, data analyzers and business intelligence providers. The app has the right to share your personal data as necessary for the aforementioned third parties to provide their services for the app. The app is not liable for the acts and omissions of these third parties, except as provided by mandatory law. The app may disclose your personal data to third parties as required by law enforcement or other government officials in connection with an investigation of fraud, intellectual property infringements, or other activity that is illegal or may expose you or the app to legal liability. the app may also disclose your personal data to third parties when the app has a reason to believe that a disclosure is necessary to address potential or actual injury or interference with app’s rights, property, operations, users or others who may be harmed or may suffer loss or damage, or the app believes that such disclosure is necessary to protect the app’s rights, combat fraud and/or comply with a judicial proceeding, court order, or legal process served on the app. To the extent permitted by applicable law, the app will make reasonable efforts to notify you of such disclosure through the app’s website or in another reasonable manner. SafeguardsThe app follows generally accepted industry standards and maintains reasonable safeguards to attempt to ensure the security, integrity and privacy of the information in the app’s possession. Only those persons with a need to process your personal data in connection with the fulfillment of their tasks in accordance with the purposes of this Privacy Policy and for the purposes of performing technical maintenance, have access to your personal data in the app’s possession. Personal data collected by the app is stored in secure operating environments that are not available to the public. To prevent unauthorized on-line access to personal data, the app maintains personal data behind a firewall-protected server. However, no system can be 100% secure and there is the possibility that despite the app’s reasonable efforts, there could be unauthorized access to your personal data. By using the Services, you assume this risk. OtherPlease be aware of the open nature of certain social networking and other open features of the Services the app may make available to you. You may choose to disclose data about yourself in the course of contributing user generated content to the Services. Any data that you disclose in any of these forums, blogs, chats or the like is public information, and there is no expectation of privacy or confidentiality. The app is not responsible for any personal data you choose to make public in any of these forums. If you are under 15 years of age or a minor in your country of residence, please ask your legal guardian’s permission to use or access the Services. The app takes children’s privacy seriously, and encourages parents and/or guardians to play an active role in their children’s online experience at all times. The app does not knowingly collect any personal information from children below the aforementioned age and if the app learns that the app has inadvertently gathered personal data from children under the aforementioned age, the app will take reasonable measures to promptly erase such personal data from the app’s records. The app may store and/or transfer your personal data to its affiliates and partners in and outside of EU/EEA member states and the United States in accordance with mandatory legislation and this Privacy Policy. The app may disclose your personal data to third parties in connection with a corporate merger, consolidation, restructuring, the sale of substantially all of the app’s stock and/or assets or other corporate change, including, without limitation, during the course of any due diligence process provided, however, that this Privacy Policy shall continue to govern such personal data. The app regularly reviews its compliance with this Privacy Policy. If the app receives a formal written complaint from you, it is the app’s policy to attempt to contact you directly to address any of your concerns. The app will cooperate with the appropriate governmental authorities, including data protection authorities, to resolve any complaints regarding the collection, use, transfer or disclosure of personal data that cannot be amicably resolved between you and the app. Contact us"},{"title":"About Us","date":"2019-04-17T07:45:39.000Z","updated":"2019-04-26T09:46:01.435Z","comments":false,"path":"About/index.html","permalink":"http://localhost:4000/About/index.html","excerpt":"","text":"Bruce Game Studio is a dynamic and fast-growing emerging developer of wireless entertainment applications focused on mobile game development and design. The core personnel of the company are from well-known game companies, GameLoft, Virtuos and Ubisoft, all of which have been in business for more than 8 years. I have participated in the research and development of console games in the next era, and have been focusing on the development and design of 3D games. The company’s strong technical strength and creative design capabilities enable the company to quickly launch games suitable for the general public to meet the changing needs of users and the development of the game market. Contact us"}],"posts":[{"title":"Unity-iPhone has Conflicting Provisioning Settings","slug":"unity-iphone-has-conflicting-provisioning-settings","date":"2019-05-02T16:16:58.000Z","updated":"2019-05-05T06:02:47.722Z","comments":true,"path":"unity-iphone-has-conflicting-provisioning-settings/","link":"","permalink":"http://localhost:4000/unity-iphone-has-conflicting-provisioning-settings/","excerpt":"","text":"Unity-iPhone has Conflicting Provisioning SettingsSelect the top level node called Unity-iPhone in the left tree view (the one with the blue item). Select Automatically manage signingSelect your team (now the error message should appear)Go to Build setting in the tabFind the Group called “signing” in the structured tableChange the values from “iPhone Developer” to “iOS Developer”Switch back to general (the error message should now disappear)Your project should compile now and should be runnable on your iPad or iPhone. A much more comfortable way to do this would write some ‘OnPostProcessBuild’ event like this: string target = pbxProj.TargetGuidByName(PBXProject.GetUnityTargetName()); pbxProj.SetBuildProperty(target, &quot;\\&quot;CODE_SIGN_IDENTITY[sdk=iphoneos*]\\&quot;&quot;, &quot;\\&quot;iPhone Developer\\&quot;&quot;);","categories":[{"name":"Blog","slug":"Blog","permalink":"http://localhost:4000/categories/Blog/"}],"tags":[]},{"title":"DXT1(ETC1) compressed textures are not supported when publishing to iPhone","slug":"dxt1-compressed-textures-are-not-supported-when-publishing-to-iphone","date":"2019-05-02T16:09:55.000Z","updated":"2019-05-05T06:17:16.451Z","comments":true,"path":"dxt1-compressed-textures-are-not-supported-when-publishing-to-iphone/","link":"","permalink":"http://localhost:4000/dxt1-compressed-textures-are-not-supported-when-publishing-to-iphone/","excerpt":"","text":"DXT1/ETC1 compressed textures are not supported when publishing to iPhonePackages/com.unity.ads@ 1.0.7/Editor/Resources/Editor/landscape.jpgIncluded from scene:UnityEngine.GUIUtility:ProcessEvent(Int32, IntPtr)ETC1 compressed textures are not supported when publishing to iPhonePackages/com.unity.ads@ 1.0.7/Editor/Resources/Editor/portrait.jpgIncluded from scene:UnityEngine.GUIUtility:ProcessEvent(Int32, IntPtr)Building - Failed to write file: resources.assetsUnityEngine.GUIUtility:ProcessEvent(Int32, IntPtr)Build completed with a result of ‘Failed’UnityEngine.GUIUtility:ProcessEvent(Int32, IntPtr)UnityEditor.BuildPlayerWindow+BuildMethodException: 5 errorsat UnityEditor.BuildPlayerWindow+DefaultBuildMethods.BuildPlayer (BuildPlayerOptions options) [0x00207] in /Users/builduser/buildslave/unity/build/Editor/Mono/BuildPlayerWindowBuildMethods.cs:172at UnityEditor.BuildPlayerWindow.CallBuildMethods (Boolean askForBuildLocation, BuildOptions defaultBuildOptions) [0x00050] in /Users/builduser/buildslave/unity/build/Editor/Mono/BuildPlayerWindowBuildMethods.cs:83UnityEngine.GUIUtility:ProcessEvent(Int32, IntPtr) Solution: Go to: on MACUsers/%userprofile%/Library/Unity/cache/packages/packages.unity.com/com.unity.ads@1.0.7/Editor/Resources/Editor/ on Windows%userprofile%\\AppData\\LocalLow\\Unity\\cache\\packages\\packages.unity.com\\com.unity.ads@1.0.7\\Editor\\Resources\\Editor Open portrait.jpg.meta and landscape.jpg.meta Find field textureFormat: -1 (or 1) Change this value to this one textureFormat: 4 By the way, you need to check whether there are some .dds textures under the Assets folder while building the iPhone version. If there are some, you need to change it to .png file or just remove it (if possible).","categories":[{"name":"Blog","slug":"Blog","permalink":"http://localhost:4000/categories/Blog/"}],"tags":[]},{"title":"Iron Ant","slug":"iron-ant","date":"2019-05-02T15:49:03.000Z","updated":"2019-05-03T13:46:29.864Z","comments":true,"path":"iron-ant/","link":"","permalink":"http://localhost:4000/iron-ant/","excerpt":"","text":"Iron AntThere are many ant tribes in the insect world. In order to keep expanding their territory, these modified steel mechanical ants penetrate the fields of other insects through a dangerous mechanical world: a mechanical animal kingdom. In the game, the player must operate the machine steel ant ants to take risks. Besides collecting gold coins along the way, he also needs to find ways to avoid the obstacles along the way and eliminate the insect monsters. There are various auxiliary props along the way to help the mechanical ants accomplish the task more smoothly. Hello, guys could you come to help machine steel ant ants to complete the challenge! This is a steam style parkour game, the protagonist of the game is a modified mechanical ants. It needs to pass through a dangerous mechanical world that is like a mechanical animal kingdom. In the game, you need to control it to avoid obstacles, you can also kill monsters, so that you can get a higher score; In the same time you can also pick up the props that can help us better pass through. Hello, guys could you come to control mechanical ants to complete the challenge? Game Features: Slide the screen left/right: Rotate the pipe road Tap the screen: Shooting Click the flying monster: shooting flying monster Easy to get start Great colorful HD Graphics 机械蚂蚁的绝地求生之路昆虫世界存在许多蚂蚁部落，为了不断扩大自己的领地，这些经过改装的钢铁机械蚂蚁要通过充满危险的机械世界：一个机械的动物王国，从而入侵其他昆虫的地盘。游戏中玩家必须操作机钢铁械蚂蚁进行冒险，一路上除了收集金币之外，还要想办法躲避沿路的障碍物并消灭昆虫怪物，沿途还有各种辅助道具帮助机械蚂蚁更顺利完成任务。 这是一款蒸汽风格的跑酷类游戏，游戏的主角是一只经过改装的机械蚂蚁。它需要通过充满危险的机械世界，这里就像一个机械的动物王国一样。在游戏中，你需要控制它躲开障碍，也可以击杀怪物，这样可以获得比较高的分数；同时途中可以拾取的道具可以帮助我们更好地闯关。小伙伴们快来控制机械蚂蚁完成挑战吧！ 游戏特色: 左右滑动屏幕来：旋转管道道路 点击屏幕：开枪发射子弹 点击飞行的怪物：朝怪物射击 简单容易上手 高品质的图形表现","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Dead Racer 3D","slug":"dead-racer-3d","date":"2019-05-02T04:19:08.000Z","updated":"2019-05-02T15:36:21.247Z","comments":true,"path":"dead-racer-3d/","link":"","permalink":"http://localhost:4000/dead-racer-3d/","excerpt":"","text":"Dead Racer 3DCan you survive in the world destroyed after a nuclear war? With radiation, hunger and diseases around you. You have to cross the whole country and save your family. who knows if they are alive, or maybe radiation and deadly virus have already reached them? reveal a secret of the apocalypse and get your memories back during a journey across the huge territory of the ussr in the 80th. In game, you need to drive your way through a zombie apocalypse. Fire your guns and kill all zombies in your path. Avoid other cars and obstacles and get as far as you can.‘Dead Racer 3D’ allows you to choose your car and upgrade it. Personalize your car by changing its weapon or its armor. Also, you can buy new car models in the store.Kill all zombies in your way, gather as many coins as you can, and upgrade your ride in this amazing game! It is not easy to survive after apocalypse. You’ll face the real hungry games! monsters, zombie, thirst, uncountable diseases and injuries, blood-thirsty enemies – You have to fight it all. Craft all your resources: weapons, clothes, means of transport. Scout through immersive environments, engage in rapid-fire combat and build the ultimate super-soldier as you customise their state of the art gear.Team up with wolf, jackson and the rest of strike force as you target hostiles and take down the evil elite order. Features: Lots of zombie killing fun. Great cars &amp; vehicles and guns &amp; weapons: Free and customize your vehicle and weapon as you wish Good HD colorful graphics. Simple control &amp; easy to get start. Multiple amazing design levels 死亡车手3D当病毒蔓延整个世界，无数的人变成丧尸，作为一名幸存者，在危机四伏的丧尸城中，你唯一能做的只有猎杀丧尸、拯救你自己以及其他的幸存者！游戏背景设定在未来末日世界，玩家驾驶战车在充满丧尸的公路上高速飞驰。沿途，你需要开枪扫射并杀死所有的僵尸，反应迅速敏捷躲避路中报废的车辆以及其他障碍物，同时尽可能快速地驾驶。 想成为僵尸之城的侠胆车手么?快来免费体验驾车驰骋横扫僵尸的畅快吧! ‘死亡车手3D’可以让你选择购买车辆，并对它进行个性化的改装：改装它的装备和武器。当然你也可以在商店里购买新的车辆。干掉沿途的所有僵尸，收集尽可能多的硬币，然后升级你的座驾！置身僵尸群中,拥有一款强劲、操控灵活的座驾,是安全的最根本保证。行云流水般地穿越城市废墟, 连续碾压、射杀僵尸以获得更高能力, 不断挑战自我极限,创造更高纪录! 游戏中，你可以获得各式汽车甚至是坦克，你也可以改装它们，为它们装上各种武器，但你更要保护好它们，躲避开途中的障碍物，车辆是你逃生的唯一工具。途中还会有许多丧尸袭击你，不要吝啬你的子弹，杀光它们，快速冲出去！你能逃出生天吗？ 游戏特点： 体验猎杀僵尸的畅快淋漓快感。 许多的可供驾驶的汽车等车辆和各种各样的枪械武器。 自由改装和组合的车辆和武器 操作简单，容易上手 不错的图形表现。 易于上手的游戏玩法。 多个精心设计的游戏关卡","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Zombie Reaper 3D: Horror Strike","slug":"zombie-reaper-3d-horror-strike","date":"2019-05-02T04:17:57.000Z","updated":"2019-05-05T03:54:57.291Z","comments":true,"path":"zombie-reaper-3d-horror-strike/","link":"","permalink":"http://localhost:4000/zombie-reaper-3d-horror-strike/","excerpt":"","text":"Zombie Reaper 3D: Horror StrikeYou may the last survivor of your team,and the last human in this city,give up? No! It’s the time to be the grim reaper in this Zombie Hell,blow the heads of them,bring them “home”! Zombies are weak at the neck and head part, so try to shoot them at head part to see the head shot effect.Remember that don’t let them bite you. Tips: Shoot the head of them, then one bullet can make target dead Shoot fast, then you can get higher score Bullet can pass through walls, then you can kill zombies without seeing them Grenades only kill zombies, so you can throw it freely into the “dead” 僵尸收割者3D: 死亡恐怖来袭僵尸狂潮再度来袭，小镇仿佛一夜之间变为死城。而你和其他特战成员在潜入小镇执行营救任务失败，不幸被包围，战友全部牺牲，作为唯一的幸存者，放弃？不。。。你要一战成神！ 游戏玩法: 僵尸的头部非常脆弱，一颗子弹就可以搞定 尽可能快速射击，那么您可以得到高分 子弹都可以穿墙，所以你可以在看见它们之前就干掉它们 手雷伤害只会针对僵尸，所以你随意地使用手雷","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Rocket Boy 3D","slug":"rocket-boy-3d","date":"2019-05-02T04:16:38.000Z","updated":"2019-05-05T03:53:35.037Z","comments":true,"path":"rocket-boy-3d/","link":"","permalink":"http://localhost:4000/rocket-boy-3d/","excerpt":"","text":"Rocket Boy 3DNaughty and brave Rockets boy have taken a challenge: pass through a mysterious underground maze alone. To complete the challenge and prove himself, he has to ride rockets pass through various mazes with difficulties. Rocket high speeding in the maze of the channel, avoid to crash into the maze walls, hold or release the arrow keys to choose the right path while in the fork of junction, that is what you need to do in the game. This may requires some reaction and wisdom, but I guess you should be able to deal with it easily. So, come and challenge with the rocket boy together! How to Play: Hold screen or release finger to switch the fly direction 火箭男孩顽皮而又勇敢的火箭男孩接受了一个挑战：孤身一人独闯某个神秘的地下迷宫。为了完成挑战证明他自己，他要骑火箭闯过一个个艰难的迷宫。驾驶火箭高速飞驰在迷宫的通道内，避免撞到迷宫墙壁，在岔道口按下或者释放方向键，选择正确的路径就是你在游戏所需要做的。这需要一些的反应速度和智慧，你应该能轻松应对的。那么快来和火箭男孩一起完成挑战吧！游戏玩法： 按住屏幕或者释放手指切换飞行方向","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"No Rule WarZone","slug":"no-rule-warzone","date":"2019-05-02T04:15:24.000Z","updated":"2019-05-05T03:52:14.437Z","comments":true,"path":"no-rule-warzone/","link":"","permalink":"http://localhost:4000/no-rule-warzone/","excerpt":"","text":"No Rule WarZoneThis game is a classic hardcore FPS games, in which you can complete combat sniper stealth missions, you can explore 20 stealth shooter levels with 3 themes likeCity, Port and Snow, you have to destroy all the enemies in a limited time to complete the mission, you can test your shooting ability and combat skills to becomea real shooter! You are a warrior, you have excellent fighting skills. Now that terrorists have occupied the city, you have to find and destroy them before the terrorists destroythe city. The army provides you with advanced super weapons, so you can more easily complete the mission. The mission is very difficult, but for those innocentpeople, you have to come forward, destroy the enemy, defend the city. Accurate aiming at the target, firing, more accurate elimination of the surrounding terrorists. Ready to fight with the terrorists desperately, and strive toshoot. In order to make you better fight with terrorists, your troops prepared a lot of advanced weapons for you. You are a front-line commando, have excellentcombat skills, show all your skills, penetrate the enemy’s territory, find and destroy hidden goals. As the levels progress, the mission gets tougher and the rewards get higher. So equip yourself with the best gun and hunt them down to be the top shooter.Search for targets based on radar instructions; completing missions within a specified period of time. Use your huge reward to unlock your favorite from avariety of options like Shooting guns, war weapons, assault rifles, main / auxiliary weapons and Sniper rifles. The battlefield is full of crisis, all kindsof cutting-edge weapon after another, whether you can escape all the attacks, to complete all the challenges. Game Features: the real military environment all kinds of modern weapons Challenging missions realistic shooting effect Smart AI amazing music and sound effects Fast-paced shooting game 法外之地这是一款经典的第一人称射击游戏，在这款游戏里面，你可以完成各类狙击潜入任务，完成20多关不同主题的射击任务，主题包含城市，码头，雪地。你必须在规定的时间内击败所有的敌人，你也可以通过游戏锻炼你的射击能力和战斗技巧，最终成为一名真正的射击者，击败恐怖分子，保卫自己的家园。 现在你是一名勇敢的士兵，你准备好战斗在真实的战场恐怖分子？现在是时候出击，拿起你的武器，向前走，在战场上战斗。摧毁敌人的残暴，完成使命。 你的城市受到了威胁。恐怖分子潜入你的城市和制造混乱。你作为一个突击队的前锋，接受军队的使命。消灭谁混进城所有的恐怖分子，拯救无辜的人，恢复城市的和平。这将是一个艰巨的任务，你必须使用你的高超的射击技巧和作战能力，在战场上生存和完成任务。 军队为您提供各种先进和强大的武器，让你可以更容易地消除恐怖分子，完成使命。有先进的雷达系统，使您更好地寻找所有的敌人。一个强大的狙击镜头可以搜索更远的目标。当你完成任务后，你将进入下一个任务，任务逐渐变得困难。展示你高超的射击技能，完成所有的任务，成为一个真正的狙击手。 游戏特色： 真实的战场环境 射击武器，特殊武器，重武器，突击步枪，主副武器 挑战射击任务 高清图像 惊人的音乐和声音效果 一款刺激好玩的射击游戏，游戏采用了逼真的3D画风 玩家需要化身为一名特种部队的士兵，使用各种枪械执行任务，消灭所有敌人","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Beach Volleyball Champions 3D","slug":"beach-volleyball-champions-3d","date":"2019-05-02T04:13:58.000Z","updated":"2019-05-02T05:59:00.226Z","comments":true,"path":"beach-volleyball-champions-3d/","link":"","permalink":"http://localhost:4000/beach-volleyball-champions-3d/","excerpt":"","text":"Beach Volleyball Champions 3DThis Volleyball game has realistic Physics, is combined with intuitive controls and beautiful graphics, developed by unity engine. Compete at indoor or Beach Volleyball Arena, rules of the game are the same as 2 player Beach Volleyball. Capture the spotlight and build your legacy in the most authentically competitive volleyball game on the planet. Experience pure beach volleyball fun and compete with other national teams to win Olympic gold medals. You have full control over your player with manual serving, passing and smashing. Swipe your finger to send the ball flying in the direction you want now! Real Beach VolleyBall World Champions 3D Features: Intuitive, one finger controls Impressive HD graphics and great animations Challenge mode and quick game mode Simple yet powerful touch controls with timing control 激情沙滩排球冠军赛3D欢迎来到“激情沙滩排球冠军赛3D”全球挑战赛！在这裡，你可以自由打造队伍，挑战来自不同国家的球队，全球沙滩之巅，等待你征服！精美的沙滩海岸，可以随意搭配培养的人物，操作简单却又激情四射的比赛，时刻挑逗著你的神经！阳光，沙滩，比基尼，你还在等待什麽？快来加入我们火热的沙滩排球比赛之中吧！ 游戏特色： 自由组建、培养队伍，还可以更换球员肤色 多种服装和髮型随心搭配 数十个可选国家，并为每个国家精心定制了队服 突破性的滑屏玩法，一根手指，享受一场比赛 精美的沙滩场景与角色建模，给你最真实的感受","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Street Football Show","slug":"street-football-show","date":"2019-05-02T04:12:18.000Z","updated":"2019-05-05T03:54:04.172Z","comments":true,"path":"street-football-show/","link":"","permalink":"http://localhost:4000/street-football-show/","excerpt":"","text":"Street Football ShowSoccer, street light and naughty boy, what will you think of when you see those words? Does it remind you the days that you are young? Can you imagine that a naughty boy focus playing a soccer under the street lights? This boy is so much focusing on playing football, so that him forget the time goes by. All kind of cool actions, ball jump, fly and rotate under the control of his feet, it seems the ball is a part of the body. And finally show a beautiful balcony shot. And a moment later, someone comes out from the buildings and shout …All that are this game provides for you. Cool with ball action show (street style) and balcony shot. Of course nobody will blame you when you give a balcony shot in the game. Play the ball always as your wish here. So guys, please go and give it a try! How to play: balcony shot: click the ball and slide to balcony on the screen to kick out football street style: operate differently to different with ball actions 街头足球秀足球，路灯和淘气的男孩，当你看到这些词语时你会想到什么？它是否使你记起那些年少日子？你能想象出一个顽皮的男孩在街灯下聚精会神踢足球的画面吗？ 这个男孩非常专注于踢足球，以致他忘记了时间的流逝。在脚掌的控制下，各种酷炫的动作，跳球，飞行和旋转，这看起来球似乎是身体的一部分。在动作的最后展示一个美丽的阳台射门。 一会，就有人从大楼里走出来，大声叫喊起来……所有以上这些都是本游戏为你提供的。 酷炫的球动作秀（街头风格）和阳台射门。当然当你在游戏中阳台射门时，没有人会责怪你。这里，你可以随意的把玩足球。那么，伙计们快来试试吧！ 游戏玩法: 阳台射门：屏幕上点击球并滑到阳台来把足球开踢向阳台 街头风格：对于不同的控球动作进行不同的操作","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Twisty Truck Driver 3D","slug":"twisty-truck-driver-3d","date":"2019-05-02T04:11:02.000Z","updated":"2019-05-05T03:54:34.844Z","comments":true,"path":"twisty-truck-driver-3d/","link":"","permalink":"http://localhost:4000/twisty-truck-driver-3d/","excerpt":"","text":"Twisty Truck Driver 3DDo you like truck driving games?Twisty Truck Driver 3D is one of the truck driving games that you will deliver cargo on mountain roads. Twisty roads, risky ramps and downhills will make you feel like driving a real truck. It’s time to drive the truck to complete all routes. Heavy cargoes will cause truck to fall into the cliff.These features will make this driving simulator the best on truck games. Download now for fun. Features Steering Wheel, Buttons or Tilting controls Realistic 3D graphics and physics Day and night maps Mountain roads Hill climb 运货卡车爬坡模拟3D你喜欢卡车驾驶模拟游戏吗？‘运货卡车爬坡模拟3D’是一款模拟在山路上驾驶运输卡车运送货物的游戏。蜿蜒曲折的山间道路，危险的斜坡和下坡会让你觉得你是在驾驶一辆真正的卡车。现在是时候开卡车完成所有的运货路线了。稍有不慎，重型货物将导致卡车掉入悬崖。该游戏还有以下特色，这些功能将使这款驾驶模拟游戏成为喜爱卡车模拟游戏玩家的最佳选择。那么，快来试试吧！ 游戏特色: 多种控制方式：方向盘，屏幕按钮或屏幕倾斜控制 逼真的3D图形表现和真实的物理模拟 白天黑夜地图 蜿蜒曲折的盘山道路 卡车爬山模拟","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Extreme Falling 3D","slug":"extreme-falling-3d","date":"2019-05-02T04:09:45.000Z","updated":"2019-05-02T15:37:16.687Z","comments":true,"path":"extreme-falling-3d/","link":"","permalink":"http://localhost:4000/extreme-falling-3d/","excerpt":"","text":"Extreme Falling 3DWelcome to this super extreme falling racing game, fasten your seat belts and get yourself ready to surf through this infinite and a never-ending tunnel. hit any obstacles and you lost. it uses the orientation sensor or screen side touch as controls, making it very direct and intuitive. “Extreme Falling 3D” is specially designed for the people who love real racing dash games. the objective is to dash through a twisting color tunnel full of obstacles at a high-speed. there is no margin of error in this fast-paced death pipe environment. your race is instantly over as soon as you make a mistake and hit yourself with an obstacle coming your way. making it out alive from this playground tunnel is almost impossible. the challenge is how far can you go and how much time you can survive in this death pipe? don’t forget to collect gems on your way through to get points. Extreme Falling 3D seem easy but hard to play. your goal is to just tap on right moment to move direction left,right. this game require your concentration to survive if you lose it at any point, the game will take back you from where you start. Extreme Falling 3D is a reflex game where you avoid obstacles to get as far as you can. Race through endless twisting tunnels in the ultimate test of your racing skills. The game offers many challenging game modes. Rush down the colorful tunnel at high speed, collect gold and gems, use your special abilities wisely. Simply download for fun! Enjoy it! GAME FEATURES: fast-paced, endless fun and real racing game-play colorful and eye catchy graphics used movie quality sounds and music simple and easy tilt controls game is free to install and play 极限坠落3D欢迎来到极限坠落3D你将身临其境地穿越我们精心设计的意境，在这个安详美丽的万花筒管道世界中体验无限的坠落的刺激感。 极限坠落3D是一款考验反应的赛车类休闲游戏。游戏中您在无尽的管道中不断向下坠落，您需要避开下方出现的障碍物，并尽量持续更长时间。 在无尽的扭曲隧道进行无尽的坠落，最终测试您的跑酷技巧。 游戏提供许多具有挑战性的游戏模式 高速冲下五彩缤纷的隧道，收集金子和宝石，这需要你合理地使用某些特殊能力。 点击左侧和右侧屏幕来躲避障碍物，尽可能地收集所有的宝石，并获取高分。 穿过隧道，同时躲避这无尽的过山车骑行中的空白。想想快速和轻扫扭转隧道切换车道，以达到令人难以置信的速度！ 游戏特色： 老少皆宜 简单的玩法 无限的游戏模式，不间断前行 不错的图形表现 动听的音乐 免费下载安装","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Mountain Road Taxi 3D","slug":"mountain-road-taxi-3d","date":"2019-05-02T04:08:29.000Z","updated":"2019-05-05T03:52:06.557Z","comments":true,"path":"mountain-road-taxi-3d/","link":"","permalink":"http://localhost:4000/mountain-road-taxi-3d/","excerpt":"","text":"Mountain Road Taxi 3Dcrazy taxi driver on zigzag risky snow mountain road, taxi driving simulator Mountain Road Taxi 3D is the latest and the greatest taxi game of all the taxi driving games. In the driver game, you should pick up nice passengers from the hill station resorts, going through a rugged risky mountain road,enjoying fantastic scenery. Signal a turn with your blinker.Train your skills and to be a pro taxi driver.In these Asian countries the city taxi is the cheapest way of passenger transportation from one taxi stop to another. Other taxi games not contain these types of Offroad taxi games features. You will become taxi master in this jeep game by showing your taxi parking skills with your Indian taxi or any other transport car or jeep drive. Perform efficient cab driving with your taxi 2018 and become hero of all taxi games. Be an Indian taxi driver because once the passenger sit in your taxi car then you can collect coins from the risky road and steep paths.Hill Station is packed with thrilling and exciting pick and drop missions. Pick up passengers from distant locations and take them to their destination on time. The sights of snowy rocky hills will add enjoyment to your journey.In this taxi drive, you can see the mesmerizing and green hill environments. Perform your duty in this taxi simulator game skillfully to enjoy your taxi ride. This real taxi 3d needs skills of professional taxi driver with limited fuel. So,be quantitative during taxi driving with your off-road drive. Drive a powerful taxi cab in any kind of environment like Off-road Mountains and city traffic. So, enjoy cab drive with smooth and realistic controls like a real taxi on the environment. Good Luck.In the beginning, you own a basic taxi and by picking up passengers, you can buy a more sophisticated taxi.?Be a polite driver, say hi to a passenger when he gets on the bus and drunk before you drive is not allowed. You can take passengers to the scenic spots where they wants to visit and while on the risky road you can turn on the Intel player and listen to music. As a qualified taxi driver, remember to keep your words.Drive with real 4x4 taxi cars, making sure your wheels gain the best traction and power possible. However the peculiar nature of this taxi car beast means that it’s not always possible to drive careless. So we hope you will have fun playing this taxi driving game . It will never be a drag getting a couple of tonnes of car up these risky road and complete the duties you have as a cab driver.Enjoy the hill car driving, the game can give you fun which other taxi games can’t give you. The features of Mountain Road Taxi 3D include: Summer and Winter Season Environments Amazing Hill Station Environments and 3D Graphics Thrilling Precision Taxi Driving Experience A lot of taxi drive in the garage. Addictive game play. Fun and challenging levels 山道出租车3D冬季雪山蛇形弯曲公路上的疯狂客运出租车司机，山路出租车驾驶模拟 这是你一直在寻找最好的出租车模拟游戏。您驾驶您的出租车在驾驶舱浏览并沉浸在优美的环境中。感受新的无止境的越野冒险。倾斜您的设备来控制您的出租车，赚取硬币、购买新的出租车和升级出租车。你可能玩过不同的爬坡游戏，但这次你肯定会享受更多乐趣。这是最好的最令人上瘾的游戏，在隆隆的汽车声中，感受最真实的出租车驾驶体验。通过改进的物理引擎，你会感觉到最接近于顶层的真实模拟。有新模式和无尽模式，独特和不同的8大气候等待着你去发现。真实天气条件下的冒险等着你。驾驶各种出租车在泥泞的道路上。发动所有车轮驱动，当很难行驶时，用绞盘把你自己从麻烦中拉出来。在山上开车可以是令人兴奋和冒险的，因为你必须驾驶重型出租车沿着山和危险的令人感到眩晕的小径行驶。注意在山路上慢慢行驶，避免涡轮螺旋桨飞机，并避免周围的桅杆和摩托车，注意颠簸和急转弯。小心别让轮胎卡在泥里了。开车穿过山谷，穿过泥泞的小路。成为一名有很强驾驶技能的司机。记住要安全驾驶。不要超载。功能包括:-3D驾驶游戏，精彩的游戏玩法 3种控制模式，切换你喜欢的模式-驾车穿越丛林和沙漠，爬山，疯狂驾驶-完全免费和令人印象深刻的平滑的游戏玩法-真实的3D图形和山坡环境爬山","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Trials Gold 3D","slug":"trials-gold-3d","date":"2019-05-02T04:07:10.000Z","updated":"2019-05-05T03:54:28.364Z","comments":true,"path":"trials-gold-3d/","link":"","permalink":"http://localhost:4000/trials-gold-3d/","excerpt":"","text":"Trials Gold 3DTrials Gold 3D is an excellent and entertaining trials game with awesome stunts, jump, roll, dash and slide over to avoid amazing obstacles while you master the tricky tracks. Race through these dangerous levels without losing your control to unlock exciting new levels in this addictively fun trials game. This game has some great graphics and tons of cool things to look at, and has 20 amazing new addicting levels and 3 bikes.This Trials Gold 3D game, will take your breath away with its new innovations and new amazing stunts and its smooth game-play will make you play this game for hours. Game Features: Real world 3D environment Realistic controls 20 Levels with scaling difficulty Ultimate Trials challenges High resolution graphics for both phones and tablets 极限摩托特技3D极限摩托特技3D是一款优秀且有趣的摩托驾驶游戏，它包含了怎么样驾驭棘手的赛道，驾驶摩托展现特技，跳跃，翻滚，冲刺以及滑行来避免惊人的障碍。在这个容易上瘾的赛车游戏中，你需要比赛通过这些危险的关卡，同时又不失去你对摩托车的控制，这样可以解锁令人兴奋的新关卡。这个游戏包含有不错的图形表现和一些看起来很酷的东西，它共有20个惊人的新上瘾的关卡和3辆摩托车。 该极限摩托特技3D游戏，将让你感受到极限特技的惊险与刺激。感兴趣的小伙伴来试试吧！ 游戏特色： 取材于真实世界的3D环境 简单直观的控制 带有不同难度的20个关卡 摩托特技终极挑战 不错的图形表现","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Lost Tomb Treasures","slug":"lost-tomb-treasures","date":"2019-05-02T04:05:37.000Z","updated":"2019-05-05T03:51:37.149Z","comments":true,"path":"lost-tomb-treasures/","link":"","permalink":"http://localhost:4000/lost-tomb-treasures/","excerpt":"","text":"Lost Tomb TreasuresLost Tomb Treasures is an adventure game with logical elements!Be ready to long, unforgiven trip in uncharted places. In the jungles, filled mystical secrets, behind ancient ruins, tombs and dungeons, with many danger traps on a way. Smart labyrinths come to magic Mayan temple with mysterious treasures in a final. Impeccably finish levels, become nimble tomb rider, and receive a gold coin. Collect items, artifacts and jewelry, to help in the hunt for treasure in the passing game. In addition to exciting gameplay, the game will involve you in the gameplay its intriguing storyline with an unpredictable ending.Goal of the game to find the best way through the maze with obstacles, not forgetting to collect all the treasures hidden in the level. Each level is filled with unique traps and enemies. Features: Colorful 3D graphics, a huge map with changing locations Smart gameplay, diverse sets of traps on logic and reaction The storyline with funny comics will relax your brain after difficult puzzles Three long episodes. Adventure never ends - constantly come out with new episodes, even more interesting puzzles, new traps, new stories!…and much more! 失落遗迹的宝藏“失落遗迹的宝藏”是一个带有智力逻辑元素的冒险游戏！准备好去未知的地方开启一段漫长而又难以忘怀的旅行吧。在充满了神秘的秘密的丛林里，在找到古代废墟后面、墓地和地牢的途中布满了许多危险的陷阱。接着会遇到智慧神迷宫，最后终于到达包含有神秘宝藏神奇的玛雅神殿。 近乎完美地完成关卡，成为灵活的古墓骑士，并获得金币。收集物品，文物和珠宝，以帮助在通关游戏中寻找宝藏。 除了令人兴奋的游戏玩法之外，游戏还将让您参与到迷人故事情节中，并带来难以预料的结局。游戏的目标是通过障碍物找到通过迷宫的最佳途径，不要忘记收集隐藏在关卡中的所有宝藏。每个关卡都充满了独特的陷阱和敌人。 游戏特征： 丰富多彩的3D图形，包含有延伸变化的地点的巨大地图 有趣的游戏方式，各种的逻辑谜题和陷阱 有趣的漫画故事情节将困难解惑后放松你的大脑 三个故事长片。冒险永远不会结束 - 不断出现新的剧集，甚至更有趣的谜题，新的陷阱，新的故事！…以及其他更多内容！","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Toy Truck Rally 3D","slug":"toy-truck-rally-3d","date":"2019-05-02T04:03:12.000Z","updated":"2019-05-05T03:54:21.724Z","comments":true,"path":"toy-truck-rally-3d/","link":"","permalink":"http://localhost:4000/toy-truck-rally-3d/","excerpt":"","text":"Toy Truck Rally 3DThis game lets you drive tiny toy trucks and cars. Your goal is to complete timed obstacle courses, pass through obstacles, or free roam different environments and be the toy rally champion. So, lets enjoy the fun of driving a tiny toy truck! How To Play: Control your truck by tilting your device, or use touch control for steering. 玩具卡车拉力赛3D这个游戏可以让你体验到驾驶玩具小卡车和汽车。你的目标是完成定时障碍赛，穿越障碍物，或漫游不同的环境，并且成为玩具拉力赛冠军。所以，让我们享受驾驶玩具小卡车的乐趣吧！ 游戏玩法: 通过倾斜设备来控制您的卡车，或使用触摸控制进行转向。","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"TOTEM PIPE","slug":"totem-pipe","date":"2019-05-02T04:01:43.000Z","updated":"2019-05-02T15:39:25.533Z","comments":true,"path":"totem-pipe/","link":"","permalink":"http://localhost:4000/totem-pipe/","excerpt":"","text":"TOTEM PIPETOTEM PIPE is an agile puzzle 3D games. Players control a Japanese-style puppet in a slowly rising tower, along the way to keep collecting the hidden scroll to make up the ladders, finally find the path to the top of totem pole. The level was designed carefully. There is no one scroll more or less, do not worry about wast them like bullets. Aways walk ahead is good idea, but sometimes you will find you need to walk backward when you run out of scrolls. The same as other running or racing games, the time is always limited. If you are time-out, you are killed. Then you are lost in the fog. So brave heros, come and give it a try! How to Play: Move : joy stick of the left screen X button : build ladders Z button : eat or destroy the platform (something marked with “Z” character), so that you could make a way backward. 勇闯天塔勇闯天塔是一款3D类的敏捷解谜类小游戏。游戏中玩家控制一个日本式的木偶，在一座徐徐上升的天塔之中，沿途不断收集塔内隐藏的卷轴制制作往上的梯子，并试图找出通向塔顶的路径。 游戏中的关卡是精心设计的。游戏中所需要的卷轴是恰到好处的安排的，它们不像是射击类游戏中可以随意射出的子弹一样没有数量上的限制。沿着往上的梯子往上走总是没有错的，但是某些时候当你的卷轴用光了的时候迂回前进也是明智的。就像其他的跑酷类或者赛车类游戏一样，游戏的时间也是有限的。一旦你超时了，那么你就会迷失在迷雾之中，然后就挂掉了。勇敢的骚年，来挑战一下吧！ 游戏玩法: 移动： 屏幕左边虚拟摇杆 X 按钮：制作梯子 Z 按钮: 吃掉或者销毁平台（就是那些上面标记为字符“Z”的东东），从而开辟向下的道路","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Scroll Carton","slug":"scroll-carton","date":"2019-05-02T04:00:17.000Z","updated":"2019-05-05T03:53:42.725Z","comments":true,"path":"scroll-carton/","link":"","permalink":"http://localhost:4000/scroll-carton/","excerpt":"","text":"Scroll CartonPuzzle of Rolling Box in the skyThis is a simple-yet-challenging and magical 3d puzzle game. Our main character here is a carton or a cardboard box. This cardboard box stranded on a series of puzzle-shaped platforms which floating high above the earth. What you need to do is find the way to the reach the end point: a shiny blue tile. It is seems not so easy! You need to be carefull about water drops pushing, use different scrolling ways for different tiles. And do not forget to shoot out glowing purple magic stuff at crystal switches whilst to swith on some secret tiles. Make sure do not drop off from the platform, otherwise you were dead. Furthermore you could try to use steps as less as possible, manage to get full star rating. So let us play it. Game features: Colorful HD graphics Simple and intuitive controls Amazing level design Show off your achievement to your friends How to Play: Drag or swipe to move the carton Tap any where to shoot out glowing purple magic stuff 滚动的纸箱解谜天空中3D奇幻拼图迷城上纸箱的归宿这是一个简单而又具有挑战性和奇幻的三维益智游戏。游戏的主角是一只纸箱。这个纸板箱搁在悬浮在地球之上的由一系列拼块组成的平台上。你需要做的是找到一条路径到达终点：一个闪亮的蓝色拼块。 这似乎不是那么容易做到的！你需要小心喷出的水滴对你的推动，以及在不同的拼块使用不同的翻滚方式。不要忘了朝水晶开关上发射出紫色的魔法物品，这样能开启一些秘密的拼块路径。同时，确保不要从平台上掉下来，否则你就挂了。此外，您可以尝试尽可能以最少的步骤到达终点，争取满星级评分。现在让我们来玩玩吧。 游戏特色： 丰富多彩的高清显卡 简单直观的控制 惊人的关卡设计 向你的朋友炫耀你的成就 游戏玩法： 拖动或滑动移动纸箱 点击任何地方发射出紫色魔法","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Street Light Madness","slug":"street-light-madness","date":"2019-05-02T03:58:37.000Z","updated":"2019-05-05T03:54:10.901Z","comments":true,"path":"street-light-madness/","link":"","permalink":"http://localhost:4000/street-light-madness/","excerpt":"","text":"Street Light MadnessStreet Light Madness is a traffic simulation game that about traffic lights, cars, or traffic control. This is a fun game in which you have to help the people cross the road in heavy traffic. Sound easy right? But can you escape the heavy traffic? There are a bunch of cars which move with different speeds. You have to carefully choose the time to move the people. In the game, you are the traffic light adjuster at the street crossing road. Sometimes, car traffic may creates emergency situations on the road.As a light adjuster all you need to do is switch on some lights and switch off others.But it not so simple - cars and pedestrians are not very patient if you make them wait too long. They will run as they wish, and the situation will become very worse. Cartoon graphics with low poly, but the real situation. Impatient drivers and pedestrians - who will crossing first? - You decide!A good light adjuster - how long you will keep on? Go and give a try? Game Features: Infinite challenging level Cartoon graphics &amp; awesome graphics Real street road situation, realistic experience of road crossing. Different types of people with different walking speeds, also include different vehicles Focus on the traffic signal. tap on a light to open close it. 街道交通灯这是一款关于交通灯，汽车或交通管制的交通模拟游戏。你需要成为一个有效的交通指挥员。这项工作需要真正锐利的反应和快速的反应时间。处理繁忙的交通，确保车辆畅通。这还是不是全部的内容。有时事情变得非常有趣，当你听到紧急车辆的警报时，救护车或消防车可能出现在任何地方，你的工作是让他们自由通行。紧急车辆不会停在红灯，如果你不能有效地处理交通情况，可能会造成很多麻烦。 在游戏中，你是街头十字路口的交通灯调节员。 有时候，汽车交通可能会在路上形成紧急交通事故。作为交通灯调节员，您的全部工作就是打开一些灯并或者关闭其他灯。但这并不那么简单 - 如果你让汽车和行人等待太久，他们都会变得很没有耐心。他们会按自己的意愿肆意行走，因而交通情况会变得更糟。游戏采用低模图形表现，但是是对交通的真实模拟。面对那些不耐烦的司机和行人 - 你会让谁会先穿过呢？ - 你决定！作为一个好的交通灯调节员 - 你能坚持多久了？去试试看吧？ 游戏特色: 具有挑战性的交通突发情况 真实交通路口模拟 卡通渲染效果 点击红绿灯来切换它 现实交通流量和在急切的情况 简单的操作，容易上瘾的游戏","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Endless Run 3D","slug":"endless-run-3d","date":"2019-05-02T03:56:24.000Z","updated":"2019-05-05T04:10:00.789Z","comments":true,"path":"endless-run-3d/","link":"","permalink":"http://localhost:4000/endless-run-3d/","excerpt":"","text":"Endless Run 3DRunning along a death pipe to find the truth of colorful puzzle.Fly with high speed along an endless tube filled with dangerous obstacles. Try to survive as long as possible, dodging blocks and other whimsical constructions. Colorful HD graphics Dynamic &amp; Endless gameplay Control: Accelerometer and touch screen Ability to adjust graphic quality to support old devices In Game several language support: English, Simplified Chinese and Traditional Chinese! 无尽跑酷3D《无尽跑酷3D》是一款背景设置在外太空的科幻障碍跑酷手游，游戏以第一人称视角跑酷玩法，诠释了科幻躲避障碍的刺激感，游戏中你可以利用重力感应或者屏幕点触在细长的空间轨道上飞驰，以避开标记未知文明符号的障碍物。你所需要做的就是存活更长的时间。 高清画质 动态变化 &amp; 没有终点的关卡模式 控制: 重力感或者点击屏幕 全面兼容低性能手机","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Sniper Master","slug":"sniper-master","date":"2019-05-02T03:54:42.000Z","updated":"2019-05-05T03:53:56.847Z","comments":true,"path":"sniper-master/","link":"","permalink":"http://localhost:4000/sniper-master/","excerpt":"","text":"Sniper MasterIf you have ever wanted to be a sniper then Sniper Master is certainly for your. Pick up your gun and get shooting in 14 epic training zones. Each zone with a different challenge to test your shooting skills. Stunning true 3D graphics with slow motion on good shots make this a truly stunning game.Each level brings a truly unique flavor. Everything from moving targets to aim your gun at to huge towers full of them. Some missing with timers and others with score counts needed to proceed. Features: Stunning 3D graphics engine to give you the best experience possible. 14 action packed levels to keep you playing for weeks. A variety of targets to hit from moving to static and hidden between other objects. 狙击高手如果你曾经想成为一名狙击手，那么狙击高手肯定就是专门为你做的。拿起你的枪，并在14个训练区进行射击。每个区都有不同的挑战来测试你的射击技巧。本游戏有不错的3D图形画质和慢动作镜头表现。每个训练关卡都有独特的特点。从瞄准移动物体到布满靶子的巨大塔都是您的射击目标。有些关有时间限制而有些关则是记分点数规定。 游戏特色： 比较逼真的3D表现效果,给你最好的体验 14个关卡够你玩上几周的了 不同类型的射击目标：静止不动的、运动的、隐藏的。","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"DEAD SLOPE 3D","slug":"dead-slope-3d","date":"2019-05-02T03:53:05.000Z","updated":"2019-05-05T03:50:14.310Z","comments":true,"path":"dead-slope-3d/","link":"","permalink":"http://localhost:4000/dead-slope-3d/","excerpt":"","text":"DEAD SLOPE 3DDEAD SLOPE 3D is an amazing 3D game. The gameplay is very simple, just tilt the phone to move the ball to left or right to avoid obstacles. Are you looking for a simple running game to for time killing? You found it! DEAD SLOPE 3D have a amazing and addictive gameplay! The Ball run in the city at the midnight with amazing slope paths, the controller is very simple, just tilt your phone to control the ball to run as far as you can!Is it seems simple? Oh no! If you want a high score you must use all your best skills, by your hands, by your eyes, your sharp to control the ball avoid obstructions on the way, when you get a new high score you will be excited! Try to beat all your friend and people on the world! Have a good time with DEAD SLOPE 3D Game! GAME FEATURE Endless running game! Simple and addictive Graphic in 3D Global Leaderboards Amazing slope paths Game suitable for everyone Run as far as you can 死亡下坡3D死亡下坡3D是一款有趣的3D游戏。游戏玩法非常简单，只需倾斜手机向左或向右移动球以避开障碍物。您是否在寻找一款简单的跑酷游戏来打发时间呢？那么现在你找到了！死亡下坡3D拥有令人惊叹且容易令人上瘾的游戏玩法！ 在午夜时分城市的上空，你操控着球在惊人的斜坡路径上极速翻滚。 控制球是非常简单，只需倾斜你的手机即可控制球运动方向，你所要做的就是尽可能地跑更远的距离！ 这看起来很简单吗？ 事实并非如此！如果你想获得高分，你必须使尽浑身解数，手眼配合默契，不断磨合你对球的控制，顺利躲过路上的各种障碍物和陷阱。当你获得新的高分时你会很兴奋！游戏包含有一个全球排行榜，试着击败你所有的朋友和世界上的其他玩家！ 愿你在’死亡下坡3D’游戏中玩得开心! 游戏特色 无尽的跑酷模式！ 操作简单而容易上瘾 3D图形表现 全球排行榜 有趣的斜坡弯道 老少皆宜的游戏 尽可能跑得更远","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Mountain Madness Racer 3D","slug":"mountain-madness-racer-3d","date":"2019-05-02T03:51:28.000Z","updated":"2019-05-02T15:40:29.116Z","comments":true,"path":"mountain-madness-racer-3d/","link":"","permalink":"http://localhost:4000/mountain-madness-racer-3d/","excerpt":"","text":"Mountain Madness Racer 3DMountain Madness Racer 3D is the newest jeep driving game you have been looking for. You drive your off-road truck in cockpit view through the endless traffic and immersive environment.Feel the new endless offroad adventure. Earn money, upgrade your jeep and earn more. if your vehicle is insufficient for the new runway, you can buy new cars and upgrade them for better performance. You mayhave played different towing pulling games, but this time you will definitely enjoy more. Get now the Best most?addictive games for Android. In the rumble of the car, feel the most real monster truck driving experience. Navigate through beautiful mountains and a gorgeous terrain. Adventure is waiting for you in real weather conditions are fully reflected to your vehicle with all its feeling. Drive various monster trucks onmuddy roads. Engage all wheel drive and lock the differential when the going gets tough. Use the winch to pull your self out of trouble。 The hill driving can be exciting and adventurous as you have to maneuver and drive the heavy monster truck along hills and dangerous vertigo paths. Take care that you canter slowly on the mountain road, avoidturboprop flight, and avoid the surrounding masts and jacked.On the treacherous asphalt road, you can rescue Karen, be careful, but when you encounter the mast, press on the clutch in time, do not let the vehicle hell.?When drive monster truck on a sand dune, avoid theblocky lava and reduce the frisson of the car?so that your car and tires are not destruction.Eventually became a legend driver. Playing this hill climb monster truck racing game gives you many hours of nonstop coach gaming fun! Playing hill speed driving games have never been this much fun. Game features include: Different camera positions, cockpit camera included 3 control modes, switch the one you like Lots of monster trucks to unlock, driving to have endless fun Drive through the jungle and Desert, climb hill and drive crazily? Real 3D graphics and hillside environment for hill climbing Different 4x4 monster trucks and 4x4 monster jeeps to drive and climb hills 山地狂野飙车3D山地狂野飙车3D是你一直在寻找的最好的手机赛车游戏。您驾驶您的怪物卡车在驾驶舱浏览并沉浸在优美的环境中。感受新的无休止的越野冒险。赚钱，升级你的车，赚更多的钱。如果你的车不能适应新的跑道，你可以买新车，升级它们以获得更好的性能。你可能玩过不同的拉货游戏，但这一次你肯定会享受更多乐趣。这是最好的最令人上瘾的模拟驾驶游戏，在隆隆的汽车声中，感受最真实的怪物卡车驾驶体验。穿越美丽的山脉和绚丽的地形。在真实的天气条件下，冒险在等着你。你的车会充分地反映在它的感觉上。驾驶各种怪物卡车在泥泞的道路上。发动所有车轮驱动，当很难行驶时，用绞盘把你自己从麻烦中拉出来。在山上开车可以是令人兴奋和冒险的，因为你必须驾驶重型怪物卡车沿着山和危险的令人感到眩晕的小径行驶。注意在山路上慢慢行驶，避免涡轮螺旋桨飞机，并避免周围的桅杆和摩托车，注意颠簸和急转弯。在危险的柏油路上，小心点，但当你碰到桅杆时，及时按下离合器，不要让车掉下山。当在沙丘上驾驶怪物卡车时，避开大块的熔岩，减少汽车的震动，这样你的汽车和轮胎就不会被破坏。最终成为一名传奇车手。玩这个爬山怪物卡车赛车游戏给你无限的游戏乐趣!玩爬坡驾驶游戏从来没有这么有趣过。在游戏中有很多的怪物卡车供你选择。记住要安全驾驶。其特点包括：-不同的相机位置，包括驾驶舱摄像头。-3种控制模式，切换你喜欢的模式。-有很多怪物卡车可以解锁，开车是为了享受无穷的乐趣。-穿越丛林和沙漠，爬山，疯狂驾车。-真实的三维图形和爬山的山坡环境-驾驶不同的4x4怪物卡车和4x4吉普车","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Road Vs Car","slug":"road-vs-car","date":"2019-05-02T03:49:15.000Z","updated":"2019-05-05T03:53:27.485Z","comments":true,"path":"road-vs-car/","link":"","permalink":"http://localhost:4000/road-vs-car/","excerpt":"","text":"Road Vs Carcrazy roadeo rush of car chase Road Vs Car is a very special racing game about the road and car. There are two modes provided in this game: free road and drive car. In free road mode, players need to controls direction and ascent of the constantly growing roadway without crash into any buildings, make sure keep as long possible. In drive car mode, the player tries to keep his race car following the constantly growing roadway for as long as possible. Both of them are endless mode, so that suit for time-killing. And a global online leaderboards included, so that you could beat your high score with other players. The game graphics is fresh and elegant, I guess you will like it! So guys, come and give a try, and see how high score you will get? How to play: touch screen / tilt screen to steer roadway direction tilt screen to steer car 道路与车疯狂道路冲刺与赛车追逐者的搭配“道路与车”是一款关于道路和赛车的,非常有趣的赛车游戏。这个游戏提供了两种模式：驾驶赛道和驾驶汽车。在驾驶赛道模式时，玩家需要控制不断增长的道路的方向，而不能让它撞到任何建筑物，并确保尽可能保持较长时间。在驾驶汽车模式中，玩家尽可能较长时间地将赛车跟随在不断增长的道路上。这两种玩法都是无尽的,方便用来打发时间. 同时游戏内提供了一个全球排行榜，以便您可以与其他玩家一较高下. 游戏画面清新丽雅,我相信你会喜欢它的! 那么骚年们，来试试看看你会得到多高的分数吧？ 游戏玩法: 点击屏幕,或者倾斜屏幕来驱动赛道方向 倾斜屏幕来驱动赛道赛车前进方向","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Road Killer 3D","slug":"road-killer-3d","date":"2019-05-02T03:47:57.000Z","updated":"2019-05-05T03:53:20.333Z","comments":true,"path":"road-killer-3d/","link":"","permalink":"http://localhost:4000/road-killer-3d/","excerpt":"","text":"Road Killer 3DDrive your car through a zombie city. Fire your guns and kill all zombies in your way. Avoid other cars and obstacles and get as far as you can. You are one of the survivors in Road Killer 3D.Kill all zombies in your way and gain as many coins as you can to upgrade your car in the store. Game Features : Kill different kinds of zombies! Shoot zombies with Amazing guns Great cars and weapons. Amazing gameplay. Excellent 3D graphics. Awesome truck and cars driving physics. Realistic zombie animations. 僵尸杀手3D一款好玩的射击游戏，游戏采用经典的僵尸题材，游戏中玩家将与僵尸展开激情的战斗体验哦，游戏中丰富的玩法模式等着玩家去挑战哦！ 游戏特点： 1、融合了经典的射击游戏和永恒的赛车游戏的特点2、射击部分采用第一人称视角，全3D场景，虐杀僵尸特效夸张，音效震撼3、赛车部分僵尸会不停的爬到车上，阻碍赛车前进，玩家需要驾车摆脱僵尸，达到终点4、车辆丰富，各种军用车，装甲车，造型各异，很多都是玩家平时看不到的5、射击武器分为轻型武器和重型武器，榴弹炮，喷火器，激光炮，电浆炮，低音炮应有尽有6、真实3D模型，并且可以切换视角，体验更加刺激的竞速激情7、接近一百个关卡，场景丰富多样，有白天也有黑夜8、游戏拥有关卡模式和无尽模式，让玩家体验不同模式带来的不同刺激","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Real Chess Master 3D","slug":"real-chess-master-3d","date":"2019-05-02T03:45:52.000Z","updated":"2019-05-05T03:52:43.309Z","comments":true,"path":"real-chess-master-3d/","link":"","permalink":"http://localhost:4000/real-chess-master-3d/","excerpt":"","text":"Real Chess Master 3DThis app brings classic chess game into new dimension. With advanced 3D graphics you can feel all beauty of interacting with virtual chess set. Choose to play with AI or with real opponents. Game Features: Advanced 3D graphics; Matchmaking feature; AI with 2400 levels of difficulty; Hints for beginners - highlighting of possible moves; Different themes of chess set; 3D and 2D board variants; Both landscape and portrait screen mode supported. 国际象棋大师3D这款应用将经典的国际象棋游戏带入了新的高度。借助先进的3D图形表现，您可以感受到与虚拟国际象棋交互的所有美感。游戏中，您可以选择AI玩家或真正的对手。 游戏特色： 高级3D图形; 可以移动位置标记功能; 共有2400个不同AI难度的关卡; 初学者提示 - 高亮显示可能的动作; 不同的主题; 3D和2D板浏览棋局; 支持横向和纵向屏幕模式。","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"2D Rally Race Against Time","slug":"2d-rally-race-against-time","date":"2019-05-02T03:44:28.000Z","updated":"2019-05-02T05:49:45.470Z","comments":true,"path":"2d-rally-race-against-time/","link":"","permalink":"http://localhost:4000/2d-rally-race-against-time/","excerpt":"","text":"2D Rally Race Against Timeracing car climbing mountain simulation/simulateYou drive a buggy to a rugged mountain range, ready for an extreme racing challenge, driving a buggy on a hilltop, moving to a target location within a specified amount of time, constantly gaining new distances and challenging higher points; and paying attention , Here’s buggy is no brake, only the throttle. You can only choose to accelerate forward. 2D RALLY FEATURES 2D Rally: Race Against Time is a 2D racing game with one touch controls Procedurally generated hill tracks with check points Compare your rally racing skills against others and share your highscore to friends NO in-app purchases In game leaderboard. Can you beat your friend’s highscore? In Play achievements: distance, speed and more, compare your progress against friends Quick reset in case you crash your rally car Additional race and player stats for advanced drivers: collected medals, longest drive, average speed, high speed and crashes 2D RALLY GAME GUIDE Tap and hold the screen to start racing. Keep it down to give car more speed Try to get your car as far as possible, as fast as possible before you run out of time. Try to finish a race without many crashes Release touch to slow down speed. Handy against steep hills If you crash your car and get stuck, wait till the car resets automatically to continue the race. Open the game menu and click the rewind button to restart a race To drive further, a check point will increase your time If you are out of time, you may still make it to a check point if the car is rolling downhill! After a game over, a line segment will show your previous best drive and current drive 限时越野赛越野车爬坡模拟游戏你驾驶着越野车来到了崎岖的山脉，准备进行一次极限的赛车挑战，驾驶越野车在山顶飞驰，在规定的时间内跑到目标地点，不断的获取新的距离，挑战更高积分；并且注意，这里的越野车是没有刹车的，只有油门。你只能选择加速前行。 游戏特色 限时越野赛是一款单点触控操作的2d赛车游戏 通过玩家成绩表现程序动态生成山路 和朋友比较赛车技巧，以及向你的朋友分享你的成绩 没有应用程序内购买 游戏带有全球排行榜。看看你和你的朋友谁更厉害？ 游戏内实时成就：距离、速度、进度和其他方面，可以与你的朋友比较一番 发生碰撞翻车时，快速重置 关于高级车手的其他赛车和队员统计数据：奖牌收集，最长驾驶距离，平均车速，最高速和碰撞次数 游戏玩法 点击并按住屏幕开始比赛。 保持按下屏幕，让汽车更快 在有限时间耗尽之前让汽车尽可能地快。 尝试完成一场没有碰撞翻车的比赛 释放触摸以减慢速度。这方便应对陡峭的小山 如果您的车辆发生碰撞并卡住了，请等待车辆自动重置以继续比赛。 打开游戏菜单并点击“后退按钮”重新开始比赛 每个检查点会增加你的驾驶时间，让你开得更远 如果时间到了，汽车下坡，你可能仍然会进入检查点，继续进行驾驶。 游戏结束后，线段将显示您以前的最佳驾驶距离和当前驾驶距离","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Ragdoll Duel","slug":"ragdoll-duel","date":"2019-05-02T03:42:28.000Z","updated":"2019-05-05T04:10:29.782Z","comments":true,"path":"ragdoll-duel/","link":"","permalink":"http://localhost:4000/ragdoll-duel/","excerpt":"","text":"Ragdoll DuelIn this game you have to fight with a ragdoll enemies on a variety arenas. You can play in arcade mode and also you can destroy enemies in any of the 10 levels. Play with your friends for each other in a joint mode, or arrange a duel and fight for the title of winner arena.In the game you will find a lot of interesting things: dynamic battles, interesting recognizable levels and a lots of pleasure. Physically control ragdolls Colorful HD graphics Dynamic gameplay Playing with friend on one screen Set the type of control for all tastes 10 unique recognizable arenas Story mode Multiple difficulty select options 布娃娃决斗在这个游戏中，你必须与各种各样的场地上的火柴人进行战斗。 你可以在街机模式下玩，并击败10关卡中的所有敌人。游戏提供双人同屏竞技，你可以与朋友一同玩耍，或者进行比赛决斗，争取获胜。在游戏中你会发现很多有趣的事情：动态的战斗，有趣关卡以及很多的乐趣。 完全物理操控的火柴人 高清图形画质 动态游戏模式 双人同屏竞技 适合玩家的多种控制类型 10个独特的竞技场 故事模式 不同难度选项","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Penalty shoot 3D : Goalkeeper","slug":"penalty-shoot-3d-goalkeeper","date":"2019-05-02T03:40:00.000Z","updated":"2019-05-05T03:52:21.262Z","comments":true,"path":"penalty-shoot-3d-goalkeeper/","link":"","permalink":"http://localhost:4000/penalty-shoot-3d-goalkeeper/","excerpt":"","text":"Penalty shoot 3D : GoalkeeperSoccer champions aren’t born yet, but it will. It is time for intense penalty shooting. You，as the goalkeeper, stand still in front of the goal, watch closely where the ball it and predict how the ball fly into the goal. Suddenly, you jump up and push the ball out of the goal with your gloves precisely. The ball is not in goal！The whole football field of audiences are cheering. That moment you just like an experienced hunter shoot out the fatal blow to its prey. All kind of ball kick tricks such as ground ball,header,bicycle kick,chest-high ball,volley,slide tackle and so on are useless to you. Because you are the best goalkeeper with gold gloves honor! Now it’s your turn to start write your own goalkeeper legend. How to Play: click and drag gloves to the incoming ball 点球大战3D : 最佳守门员足球冠军队还没有诞生，但它肯定诞生。现在是紧张的罚球时间。 你，作为守门员，站在球门前，仔细观察球的位置并预测球如何飞入球门。突然，你跳了起来，精确地用手套将球推出球门。球没有进！整个足球场的观众都在欢呼。那一刻你就像一个经验丰富的猎人对其猎物发出致命的打击。各种各样的踢球技巧，如地面球，头球，自行车踢球，胸部高球，抽球，滑球等对你来说都是无用的。因为你是拥有金手套荣誉的最佳守门员！那么现在轮到你开始写自己的守门员传奇了。 游戏玩法: 点击并拖动手套迎向飞来的球","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Death Orbital X","slug":"death-orbital-x","date":"2019-05-02T03:38:50.000Z","updated":"2019-05-05T03:50:25.646Z","comments":true,"path":"death-orbital-x/","link":"","permalink":"http://localhost:4000/death-orbital-x/","excerpt":"","text":"Death Orbital XGuide your planet along its such death orbit!An endless run through stars and galaxies, that is a colorful universe.Fast, challenging, rhythmic and addictive! Game features: Endless procedural track: the game changes every time you play! Rhythm-based gameplay: everything moves to the music! Portals: travel between parallel dimensions! Solar system: 8 planets to unlock with unique abilities! Extra: try get the best score and climb the top of leaderboard! 死亡轨道3D游戏中,你需要引导你的行星沿着它的轨道运行！开启穿过恒星和星系无穷尽的旅行！这是一款敏捷性的游戏，要求您快速反应，具有一定的挑战性并且令人上瘾！ 游戏特色： 无尽的程序动态生成轨道：游戏无时无刻不在改变! 基于音乐节奏的游戏玩法：一切都随美妙音乐一起跳动！ 传送门：让你穿行在不同的平行空间之中！ 太阳系：8颗行星来解锁独8种不同的独特能力！ 额外功能：获得高分并问鼎排行榜！","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Flood Factory Escape","slug":"flood-factory-escape","date":"2019-05-02T03:37:12.000Z","updated":"2019-05-05T03:50:40.638Z","comments":true,"path":"flood-factory-escape/","link":"","permalink":"http://localhost:4000/flood-factory-escape/","excerpt":"","text":"Flood Factory Escape“Flood Factory Escape” is a simple and addictive platform game.The main pump in the machinery factory was damaged. More and more water like a wild beat flood over the whole factory. But there is still one worker waiting for quit out. So you need to help and save him life. Jump and run to escape from rapidly rising water level! Good Luck! How to Play: Tap screen to jump 机械厂水灾逃亡“机械厂水灾逃亡”是一款快速简单的一触式街机游戏。机械工厂的主泵损坏了。越来越多的洪水像一只狂野的野兽一样肆虐了整个工厂。但其中还有最后一名工人等待撤离。所以需要你帮助并挽救他的生命。你需要做的就是向上跳跃和奔跑的来逃离迅速上升的水位！祝你好运！ 游戏玩法： 点击屏幕触发跳跃","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Puzzle Snowman","slug":"puzzle-snowman","date":"2019-05-02T03:35:56.000Z","updated":"2019-05-05T03:52:28.989Z","comments":true,"path":"puzzle-snowman/","link":"","permalink":"http://localhost:4000/puzzle-snowman/","excerpt":"","text":"Puzzle SnowmanLet’s play this amazing game for kids and adults. Rescue the snowman it’s amazing, adventure and brain puzzle game. Set the little snowman free from the ice blocks, and make it reach to the target successfully. When winters comes, the day of snowman plays for fun also coming. But it seems our little snowman is trapped in some ice block matrices. Can you figure out and find the right way for it? What you need to do is moving the ice block up or down and find a clear way to his objective! As you move advance, the level will become harder and harder. Some ice blocks has it’ own relationship with it’s neighbors, they will move up and down with same direction or opposite direction. So you need to move it reasonably. Any way, you could play it anytime and anywhere. just relax and enjoy this puzzle game. Game Features: Multiple amazing levels included. Click drag up an ice block to move it up, click and drag down it to move it down. Christmas spirit music Great graphics Suitable for relax addictive game-play 雪人之谜 - 雪人华容道雪人之谜是一款烧脑的益智冒险游戏。游戏主人公是一个非常可爱的小雪人。冬天来临时，贪玩的小雪人被困在了一些冰块矩阵之中。 你需要巧妙合理地移动这些冰块，开辟一条到达小雪人目的地的道路–小雪人的华容道，从而解救被困的小雪人。 游戏看似简单，然后事实并非如此。随着游戏关卡的递进，关卡难度逐步上升，这些冰柱之间的关系变得有点棘手了。例如，移动一个冰块时，它周边的冰块也可能随之一起动，或者朝着相反的方向运动。不管怎么样，在您多尝试几次后总会找到谜题的答案。相信你能为它找出一条正确的到达目的地的路径！ 游戏特色: 多个精心设计的游戏关卡 点击并向上拖动冰块将其向上移动，单击并向下拖动以将其向下移动 有冬天圣诞节氛围的音乐效果 不错的画面表现 操作简单，引人入胜的游戏玩法 适合放松或者用来打发时间 老少皆宜","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Motor Rope","slug":"motor-rope","date":"2019-05-02T03:33:58.000Z","updated":"2019-05-05T03:51:59.653Z","comments":true,"path":"motor-rope/","link":"","permalink":"http://localhost:4000/motor-rope/","excerpt":"","text":"Motor RopeOne of the most addictive and entertaining physics based bike racing game ever made!Have you ever imagined, bike can shot rope and swing like Spiderman, if you’ve never imagined, with this game your imagination into reality.Control your bike to face the challenge in every unique level, and dont forget use your rope to help complete your level and break new record.Now, let’s play this game. Game features: You can shot rope and swing like spiderman Innovative physics gameplay Smooth physics simulation Smooth and intuitive controls Unbelievable graphics Amazing level designer 5 theme world with up to 75 levels, every one is unique share your progress to your friends 摩托特技小子像蜘蛛侠一样射出绳子的摩托驾驶这是一款有史以来最容易上瘾的、有趣的、并且是基于物理的摩托车赛车游戏！你是否曾想到过摩托车可以像蜘蛛侠一样射出绳子和荡秋千。如果你从来没有设想过，那么这个游戏把你的想象变成了现实。你需要控制你的摩托车去面对每一个独一无二关卡的挑战，不要忘记使用你的绳索来帮助完成游戏关卡，并不断打破新的记录。现在让我们来玩玩这个游戏吧. 游戏特色： 您可以射出绳子，像蜘蛛侠一样摆动 创新的物理游戏 流畅的物理模拟 平滑直观的操作控制 令人难以置信的图形 令人惊叹的关卡设计 5个主题世界共计75个关卡，每个关卡都是独特的 把你的关卡进度分享给你的朋友","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Real Motogp World Racing 2018","slug":"real-motogp-world-racing-2018","date":"2019-05-02T03:32:19.000Z","updated":"2019-05-05T03:53:03.949Z","comments":true,"path":"real-motogp-world-racing-2018/","link":"","permalink":"http://localhost:4000/real-motogp-world-racing-2018/","excerpt":"","text":"Real Motogp World Racing 2018Welcome to the thrilling motorcycle racing experience! Real MotoGp Racing is a must have game for all motor bike riders! Start the engine, hit the gas and experience the thrill of handling a 200 HP beast. Go bumper to bumper with elite riders to win the world championship. Now get ready for adrenaline fueled racing action and ride your way to victory in the fastest lane of all! Game Features: Take the wheel of 10+ types of unique superbikes Fully functioning rear view mirrors Realistic 3D graphics with dynamic lighting effects 真实摩托赛车 2018这是一个摩托车赛车游戏，让你在轨道上，让你专注于赢得比赛，时间表！ 制动时间和油门正时。 体验MotoGP的激烈的赛车行动。这是一款主打摩托车竞速的全新手机游戏，各式各样的华丽造型摩托车等你一一选择，更加激情丰富的游戏竞速对战元素添加让你欲罢不能。 实际的轨道和逼真的图形使这个游戏成为最令人难以置信的美丽的游戏之一。 我们的任务是创建一个游戏，让您感受到MotoGP的激烈竞争，游戏将在一小部分时间内赢得和输掉。游戏上手容易，但是难于精通。 我们使游戏容易上手，所以每个人都可以享受，你可以挑战你的朋友。 游戏特色说明： 1、高帧速带来的极致竞速体验；2、一共10辆摩托车供你选择；3、升级和自定义你的摩托车；4、多种模式，丰富的赛车、赛道、选手选择。","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Dungeon Traps","slug":"dungeon-traps","date":"2019-05-02T03:30:30.000Z","updated":"2019-05-05T03:50:33.461Z","comments":true,"path":"dungeon-traps/","link":"","permalink":"http://localhost:4000/dungeon-traps/","excerpt":"","text":"Dungeon TrapsDungeon Traps is an adventure game that happended on a old times warrior or explorer. Use your skills to pass levels, collect coins and finally fighting with a Minotaur boss monster and so on. This game have very realistic graphics and will be a pleasure to play it. How to play: touch or hold screen icon to move, jump, crouch and combat 地宫探险地宫探险一个发生在古代战士或者探索者身上的冒险故事。游戏中，你需要使用一些技能通过关卡，收集金币，最后与一个牛头怪怪物战斗等等。这款游戏具有非常不错的图形表现，游戏也很挑战性哦。 游戏玩法: 按下或者按住屏幕图标来移动,跳跃,蹲伏和战斗","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Mini Attack Counter Terrorist","slug":"mini-attack-counter-terrorist","date":"2019-05-02T03:29:11.000Z","updated":"2019-05-05T03:51:52.222Z","comments":true,"path":"mini-attack-counter-terrorist/","link":"","permalink":"http://localhost:4000/mini-attack-counter-terrorist/","excerpt":"","text":"Mini Attack Counter TerroristWelcome to the ‘Mini Attack Counter Terrorist’ game, this is a third person shooting game. Your avatar is a cute and mini counter terrorist solider, him will need to execute some very challenge missions from his commando. Such as eliminate some enemies in the battle field, stay shooting until the rescue team was coming, or protecting some important stuff for some certain time. And so on… It is very addictive with thrilling action, smooth controls and powerful fighting. This game gives you the opportunity to become the best professional solider with guns. The ultimate army commando shooting games gives an exciting experience and thrilling action of being the pro counter shooter. In this game you have to be very sharp and fast to kill your enemies because they are very dangerous. Play counter terrorist shooting game against terrorists and clean the world from terrorism. Feel real swat action in the game , take shoots on the terrorist, from far away and closeups, through grands to destroy the terrorist. The best third person view shooting game have ak-47 gun to fight against terrorist and sniper guns along with pistol and knife for additional weapons. While finding terrorist you will have to collect shotguns, ammo,pistol and reload your gun before final attack on the enemy. If you are in critical situation during the mission you can utilize hand grenades Mini Attack Counter Terrorist Features: Use Joystick to move around- Touch and slide the screen to aim and kill the enemy Easy and intuitive controls Variety of modern weapons &amp; guns Thrilling &amp; exciting missions Immersive 3d environment Nice Graphics 小小枪战反恐突击3D欢迎来到“小小枪战反恐突击3D”游戏，这是一款第三人称视角的射击游戏。游戏的主角是一位迷你的勇敢的反恐精英战士。他将要执行一系列指挥官交代给他的非常具有挑战性的任务：消灭阵地上的敌人、坚守阵地直到救援对来临，或者保卫某项重要东西并坚守一段时间等等。 在寻找一款射击游戏？想体验参与反恐斗争的感觉吗？厌倦了第一视角的艰难操作？上帝视角的第三人称射击游戏，结合了策略玩法，一切尽在《小小枪战反恐突击3D》成为一个勇敢的反恐精英战士，打击不法分子，保卫世界和平。现在是你进行战斗的时候了。 这是一款3d画面第三人称射击游戏，玩家将扮演一位身经百战的可爱的迷你反恐突击队战士, 使用各种枪械来对抗敌人, 根据关卡完成指定任务，解锁神秘新关卡，并利用完成任务所获取的金钱购买更好的装备。 作为一名突击队员，你需要勇于面对激烈的敌人。拿起你的武器装备，摧毁敌人，完成任务。你敢接受挑战吗？ 游戏特征: -最佳反恐故事剧情扮演S.W.A.T士兵，最受玩家欢迎的基础射击模式； -多种装甲武器提供各种武器。选择你自己的战斗风格：手枪，霰弹枪，突击步枪，机枪，子机枪，LMG，狙击枪，狙击步枪，火箭等…个性化你的战斗装备 -20 +地图与高品质和惊人的图形数十种独特的地图和策略游戏，丛林，巡航，城市，别墅…用战斗的辅助物品道具，侦查和消灭邪恶的敌人。进入逼真的城市环境中，体验正义的斗乐趣… 直观简单的操作 有趣的任务 沉浸性的3D环境体验","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Maze Dungeon - Infinite","slug":"maze-dungeon-infinite","date":"2019-05-02T03:27:22.000Z","updated":"2019-05-05T03:51:44.565Z","comments":true,"path":"maze-dungeon-infinite/","link":"","permalink":"http://localhost:4000/maze-dungeon-infinite/","excerpt":"","text":"Maze Dungeon - InfiniteIf you love mazes, dungeons and adventures - this game is for you! Your hero is a treasure hunter, who came down to the dungeon of mazes. And, as you know, mazes and dungeons always have a lot of treasures, waiting for brave heroes! But be careful, it is a rare occasion when treasures are left unguarded! In the game you will find: The infinite number of mazes of various sizes (dungeons are randomly generated). Stone, wood and sand mazes. Wonderful treasures, the value of which depends on the complexity of mazes. Bonuses. Leaderboard - compete with other players! Flexible controls - select buttons or inclination, buttons on the right or on the left! Play the campaign or create you own maze - select the size and other parameters. Assistants in your maze adventures: Faithful six-shooter revolver. Just in case… Labels. Will help you to mark dead-ends and other places as you wish. Flare missile. Will help you to find path and reference points. 无限地宫之解谜大师如果你爱迷宫、地牢和冒险，那么这个游戏就是你的菜了！ 你的英雄是一个宝藏猎人，他来到了迷宫的地牢。正如你所知道的，迷宫地牢总是有藏有很多的宝藏，它们等待勇敢的英雄来发掘！但要注意，这里的宝藏并非总是无人看管！ 在游戏中你会发现：1.无穷多个各种大小的迷宫（地下城是随机产生）。2.有石材、木材和沙子的迷宫。3.迷宫中有丰厚的宝藏和奖励，它的多少取决于迷宫的复杂性。4.金币排行榜 - 可以与其他玩家较量一番！5.灵活的控制 - 可以使用按钮或重力感应控制角色，同时也可以把按钮放置在右侧或左侧！6.游戏提供闯关模式或者根据迷宫大小、以及其他参数自定义迷宫。 在你的迷宫冒险,有以下助手可以选择：1.忠实的六发左轮手枪。以防你遇到……2.标记。会帮助你随意标记迷宫死角、其他地方。3.闪光弹。帮助您寻找路径和参考点。","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Jet Robot","slug":"jet-robot","date":"2019-05-02T03:24:49.000Z","updated":"2019-05-05T04:10:15.342Z","comments":true,"path":"jet-robot/","link":"","permalink":"http://localhost:4000/jet-robot/","excerpt":"","text":"Jet RobotJet Robot is a action class leisure puzzle game. In this game you have to fly with your jet backpack as high as possible. But the flight will not look as simple as it seems. You need to avoid the obstacles on the way forward, avoid fatal traps, and collect as much fuel as possible and go beyond all. Jet Robot features Colorful HD graphics Simple control Dynamic game play Built-in online score record 喷气机器人喷气机器人(Jet Robot)是一款动作类休闲益智游戏。 在这个游戏中你必须用你的喷气背包飞的尽可能高。但飞行不会像看起来那么简单。你需要避开前进的道路上的障碍，避免致命陷阱，并尽可能多的收集燃料，并超越所有。 喷气机器人(Jet Robot)的特色 丰富多彩的高清画面 简单的控制 动态的游戏模型 内置自动分数记录","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Air Battle Hero 3D","slug":"air-battle-hero-3d","date":"2019-05-02T03:22:51.000Z","updated":"2019-05-02T16:05:25.874Z","comments":true,"path":"air-battle-hero-3d/","link":"","permalink":"http://localhost:4000/air-battle-hero-3d/","excerpt":"","text":"Air Battle Hero 3DBecome the supreme lord of the skies in the latest sky gamblers title: Air Battle Hero! Go back in time with this great title and be part of unwritten history and covert operations. Enjoy the charm and power of the jet fighter domination race and master over a dozen airplane models. A small group of hostile planes are scanning our land, reveal your secret military base. Their mission is to locate your base, destroy your whole country. Your job is to stand against these hostile planes, and defend your base in this 3D airplane flying game! Although all jet planes are ready to war, the truth is that the you may the only one left Airplane which is able to save us land. All pilots have been alerted, instructed and allowed to open fire against all enemy planes on sight, but only you are able to complete all missions and shoot down all enemy planes, without jeopardizing your land. Are you ready for the ultimate 3D Flying fun? Can you save your land by playing the Air Battle Hero 3D game? Give it a try and find out at once! Forget everything else! This is the ultimate air combat game! With an extensive simple single player campaign mode, the non-stop action will keep you at the edge of your seat! Game Features: Immersive gameplay, you are the pilot in the plane Highly polished 3D Fighter Jet awaiting for flight, Multiple Flying missions with lots of aerial checkpoints and other side-game missions, full retro sounds Dense 3D Canyon with hundreds of rocks and dangerous cliffs, Unlimited Ammo for the devastating Machine Gun of your Jet Fighter plane, Rechargeable set of 2 Rockets, Drone attacks Two different 3D camera views for showing the body or the cockpit of your Jet Fighter, Easy to get start, hard to mater it Smooth flights with stable plane control, multi-touch controls support. Stunt Graphics, realistic environments amazing 3d environments 空战英豪3D驾驶你的战机，以惊魂速度翱翔于天际之间，穿行于层云之上。浓云密雾，完美呈现。或摧毁敌机，或悠游在云霄之上.。 与这款史诗般的游戏一起回到过去，感受未被书写的历史，加入秘密飞行行动。享受喷气式战斗机统领群雄的魅力和权力，灵活掌控驾驭战斗机的技巧: 躲闪、空战和瞄准。 一小撮敌机正在扫描我们的驻防地，它们企图揭露你的秘密军事基地。他们的任务是找到你的基地，摧毁你的国家。 在这个3D飞机飞行游戏中，而你的工作就是对付这些敌对的飞机，并捍卫你的基地！虽然所有的战斗机已经准备好进行战争，但事实上，你也许是唯一幸存的能够拯救我们陆地的战斗机飞行员。 所有的飞行员都被训话和指示，允许对所有敌机直接开火。但只有你能完成所有的任务：击落所有敌机，从而保卫你的国土。 你准备好了尝试终极3D飞行的乐趣吗？你可以玩“空战英豪3D”游戏来捍卫你的家园吗？来试试看吧！ 危险无处不在。天空中到处都是虎视眈眈的敌军喷气战机， 你必将成为天空的霸主！保卫基地， 捍卫家园就看你的了，骚年！ 游戏特色： 飞行模拟器游戏 高等抛光3D战斗机等待飞行， 多个飞行任务，有许多游戏存盘点和其他支线游戏任务 密集的3D峡谷：拥有数百岩石和危险悬崖 为您的喷气式战斗机的毁灭性的机枪装备无限的弹药 装备2组火箭弹 两组不同的3D相机视图 身临其境的游戏 逼真的机舱驾驶操作体验 平稳的飞机控制飞行 操作简单便于上手，但熟练掌握需要一定的时间 令人惊叹的3d环境","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Unlink Lines","slug":"unlink-lines","date":"2019-05-02T02:26:17.000Z","updated":"2019-05-05T03:54:41.677Z","comments":true,"path":"unlink-lines/","link":"","permalink":"http://localhost:4000/unlink-lines/","excerpt":"","text":"Unlink LinesMove out circle without touchThe goal in this game is simply move the lines (sticks) out of the circle. Those lines or frames are interlock with each other, they will be obstacles as you moving. Be careful don’t touch others. How to play: click and drag the lines (sticks) out of the circle 移动线条小心移动细线到圆圈外 游戏的目标非常简单，只需要将线条（或者小木棒）移到圆圈外。 这些线条或线框彼此相互连接，它们将成为你移动时的障碍物。 移动时要小心，别让它们彼此发生碰撞。 游戏玩法: 点击并拖拽线条到圆圈外","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Highway Killing","slug":"highway-killing","date":"2019-05-02T02:24:32.000Z","updated":"2019-05-05T03:50:59.862Z","comments":true,"path":"highway-killing/","link":"","permalink":"http://localhost:4000/highway-killing/","excerpt":"","text":"Highway KillingHighway Killing a most thrilling first-person shooter game. Player serve as an excellent sniper in the game. Taking the vantage place, seeking for terrorists, and eliminate them. All kinds of weapons in store are available to choose. Long-range weapons can cause fatal damage to the enemy. Your enemies appear in the highway. Some of them drive off-road car on road. Find them and pull the trigger immediately. I am sure you will be the best sniper.You are a well-trained elite sniper, accepting secret missions, and eliminating terrorists. In this exciting game, experience the fun of shooting, zoom in, aim, kill. Pull the trigger and try for the head shot - at range.As the levels goes up, the mission gets tougher and the rewards get higher. equip yourself with powerful weapons and shoot them down to be the best shooter. You can search for targets based on red arrows, completing missions within the given time. Use your huge reward to unlock your favorite from all kinds of options like Shooting guns, war weapons, assault rifles, main auxiliary weapons and sniper rifles. The battlefield is full of crisis, they are cruel. They also try to find and strike you. I am sure you can escape all the attacks, to complete all the challenges.This shooting game in this virtual environment will bring you different experiences. As a clever killer, use you your limited ammunition to kill every enemy. The enemy does not know your presence until you pull the trigger. Swat the enemy helicopters out of the sky like flies. The critical thing for you is how to kill all the enemies. Practice your skills more, you will be the king of this game.Game features: Awesome 3D graphics. Awesome and realistic simulations. Heavy action and blood. Great battle situations. Multiple sniper guns available. 公路杀戮公路杀戮是一款激动人心的第一人称射击游戏。玩家在游戏中充当出色的狙击手。占据有利位置，寻找恐怖分子并消灭他们。商店里有各种武器可供选择。远程武器会对敌人造成致命伤害。你的敌人出现在高速公路上。他们中的一些人在公路上开越野车。找到他们并立即扣动扳机。我相信你会是最好的狙击手。你是一个训练有素的精英狙击手，接受秘密任务，消灭恐怖分子。在这个激动人心的游戏中，体验射击、放大、瞄准、暗杀的乐趣。扣动扳机，尝试一枪爆头。随着级别的提高，任务变得更加艰巨，回报也越来越高。给自己装备上强大的武器，并击落他们，成为最好的射手。您可以根据红色箭头搜索目标，在给定的时间内完成任务。使用你的巨大奖励，打开你最喜欢的枪支。各种选择，如射击枪，战争武器，突击步枪，主要辅助武器和狙击步枪。战场上充满了危机，他们是残酷的。他们也试图找到并击打你。我相信你能逃脱所有的攻击，完成所有的挑战。这个射击游戏在这个虚拟环境中会给你带来不同的体验。作为一个聪明的杀手，用你有限的弹药杀死每一个敌人。直到你扣动扳机，敌人才知道你的存在。像拍苍蝇一样猛击敌人的直升机。对你来说最关键的是如何杀死所有的敌人。多练习你的技能，你将成为这个游戏的王者。游戏特色:-不错的3D图形表现。-极好和现实的模拟。-最棒的行动和流血。-逼真的狙击情形再现。-提供多款狙击枪械","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Real Excavator Simulator 3D","slug":"real-excavator-simulator-3d","date":"2019-05-02T02:23:11.000Z","updated":"2019-05-05T03:52:57.165Z","comments":true,"path":"real-excavator-simulator-3d/","link":"","permalink":"http://localhost:4000/real-excavator-simulator-3d/","excerpt":"","text":"Real Excavator Simulator 3DDrive, Dig, Transport and live like a city builder in this game. Get ready to live like a city builder in Real Excavator Simulator 3D game. This new city construction site game offers you variety of road builder and sand excavator trucks each with their own mission and difficulty.From the experience of driving a bulldozer simulator to being a PRO crane operator and maneuvering a loader dump truck. Real Excavator Simulator 3D offers you all sort of road construction trucks and cranesfor your sand excavator task. Take your chance with this city builder game and enjoy the fun of multiple construction city simulator all in one game.As the construction worker of your own city construction site, showcase your professtional skills, when you take control of the construction crew like bulldozer, backhoe, excavator or even loader truck.No wonder you have some experience about river sand excavation, construction and builder with many of our city construction crane operator games.But this Real Excavator Simulator 3D is made specially to give you the best of sand excavator, road construction and city builder experience.Once you get behind the steering wheel of the sand excavator vehicles all your focus should be only on how to complete the construction simulator task effectively and efficiently.Packed with full controls of heavy excavator dumper truck and other construction cranes, this game will give you a hand on experience of maneuvering hydraulic river sand excavator crane using steering and other controls. Features of Real Excavator Simulator 3D: Real Construction Site Environment 3D Superior Heavy Excavator Controls Drive Excavator Crane Like a Pro Challenging City Construction Levels Drive, Dig, Transport and More 挖掘机模拟大师3D挖掘机模拟大师3D是一款模拟挖掘机的手机游戏，挑战危险级别的挖掘机特技，开不了真的挖掘机我们就在手机上体验一下就好了。 在游戏中你可以挑战国际挖掘机大赛的真实挑战项目，比如上台阶、走钢丝等，以及比实际更难，更变态的项目。当然还少不了常规的挖掘机项目比如挖土、装载等,你可以体验到真实的挖掘机挖土效果； 快来开启神奇的挖掘机冒险之旅吧！ 游戏特色： 1、高仿真的3D挖掘机，挖掘、移动、转向等等。2、顶尖的环境效果，泥土、水池、AI汽车等等。3、经典的现场施工模拟，以及趣味十足的特技挑战。4、多角度视角自由旋转，放大、缩小随时变换。5、车内视角提供更真实的第一人称驾驶体验。","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Knight Grail","slug":"knight-grail","date":"2019-05-02T02:21:42.000Z","updated":"2019-05-05T03:51:22.045Z","comments":true,"path":"knight-grail/","link":"","permalink":"http://localhost:4000/knight-grail/","excerpt":"","text":"Knight GrailIn the game a knight was ordered to find the Holy Grail. The Holy Grail is in the depths of a dark dungeon and is guarded by various traps and skeleton warriors. To gain the Holy Grail, the knight must use his wisdom and perseverance to overcome all kinds of dangers and obstacles and to reach the location of the grail. Will knight finally get the Holy Grail it? Come and give a try? How to play: Press the screen to move the knight forward (brave knight fearless, he always moves forward, his dictionary does not contain “turn back” words) 骑士与圣杯游戏中一名骑士奉命去寻找圣杯。圣杯位于暗黑地牢的深处，并且被各种各样的机关和骷髅兵守卫着。想要获得圣杯，骑士必须运用智慧和毅力克服各种各样的危险和障碍，成功到到达地牢深处。骑士最终能否获得圣杯么？赶快来挑战一下吧？ 游戏玩法： 按下屏幕朝前移动骑士（勇敢的骑士无所畏惧，他总是勇往直前，他的字典里没有“后退”二字）","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Uphill Cargo Driver 3D","slug":"uphill-cargo-driver-3d","date":"2019-05-02T02:18:45.000Z","updated":"2019-05-02T15:39:50.213Z","comments":true,"path":"uphill-cargo-driver-3d/","link":"","permalink":"http://localhost:4000/uphill-cargo-driver-3d/","excerpt":"","text":"Uphill Cargo Driver 3DUphill Cargo Driver 3D is the new edition truck cargo game in 2019 and it’s a game that tests the player’s driving skills. The difference between this and other truck driving games is that you can experience the winding and dangerous mountain road in the truck race game. As a cargo loaded truck driver, whoever you are, truck girls or truck boys, you should drive carefully in the rough road. Transport Customer’s luggage safely. Do not overload a wagon. You released the clutch and the truck began to move. Various types of trucks for you to choose from. Minivan, heavy truck, and more. It depend on you.This is the most realistic truck game in market. Deliver heavy cargo from one place to another for sterling. Drive to explore off-road environment and test your driving skills. If you want to became a truck driver and this is impossible for some reason for you, you have to try this game.It is impossible for you to drive a heavy truck at the beginning. You have to practice your driving skills. Actually minivan is a good choice. Your mission is to carry luggage. Do not overload. A caterpillar must pass through the cocoon stage to become a butterfly. You also need pass through difficulties and to be the king of the road.These roads will test your driving capability and will also enable you to increase your skill and experience on the road. Drive carefully through the dark night, in foggy weather and in thundering rain. Clutch the steering wheel and move carefully step by step in rough road. You have to drive these super huge trucks on dangerous roads in the mountains where even one mistake could lead to fatal consequences but don‘t worry this is just a driving game.You get to drive transporting trucks on hills loaded with goods as you race to get them to the destination. Blared your horn to drive out animals. The hill driving can be exciting and adventurous as you have to maneuver and drive the heavy truck along hills and dangerous paths. Take care that you truck slowly on the mountain road, do not let the cargo hanged fall off, and avoid the surrounding masts. Watch out for bumps and sharp turns as they can make the load fall off the trailer.Show your driving skills by safely transporting the objects to the destination without dropping any on the way. Carry heavy cargo across the site safely and park your trucks to complete the game. Play the best driving games of 2018. Lots of cargo items like drums, wooden pallets &amp; gas cylinders etc.As a minivan driver, you have to keep the luggage safely. Careless use of the clutch may damage the gears. When you’ve done your job well, you can be allowed to drive heave truck. Work hard and try your best to be the king of road. Remember never overload, it will increase the odds of failure. To challenge a master. Don’t be afraid. He was not a paragon. He would never be perfect. You drive heavy truck. deliver supplies to the army. The game tracks is saved in real time, so don’t worry about forgetting to save them. Enjoy the cargo truck game, it will give you more realistic experience than other truck driving games.The features of Uphill Cargo Driver 3D include:： Different Truck Models Trucks customization Real physics On screen control buttons Amazing soundtracks Excellent graphics Reverse and forward transmission 山地货运司机3D‘山地货运司机3D’是2019年最新的卡车货运游戏，也是所有卡车赛车游戏中最好的司机游戏。与其他货运游戏相比，在卡车比赛游戏中，你可以体验到蜿蜒而危险的山路。作为一名载货卡车司机，无论你是卡车男孩还是卡车女孩，在这个卡车驾驶游戏中，你必须小心驾驶从福特载货卡车，否则你会掉进山谷。安全的将乘客的行李运送到目的地。松开离合器，卡车开始缓慢开动，多种多样的卡车供你选择，小型货车，重型卡车等。这都取决于你自己。这是市场上最真实的的卡车游戏。将重型货物从一个地方运到另一个地方以换取英镑。驾驶卡车探索越野环境和测试您的驾驶技能。如果你想成为一名卡车司机，这款游戏对你来说是不可不玩的，你必须尝试这个游戏。一开始你不可能开一辆重型卡车。你必须练习你的驾驶技能。其实小型货车是个不错的选择。你的任务是搬运行李。不要超载。毛毛虫必须经过茧阶段才能变成蝴蝶。你还需要克服困难，成为道路之王。这些道路将测试你的驾驶能力，也将使你在道路上增加你的技能和经验。在漆黑的夜里，在大雾的天气里，在雷鸣般的大雨里，你必须小心驾驶这些超级大卡车行驶在山区危险的道路上，哪怕是一个错误都可能导致致命的后果，但别担心，这只是一个驾驶游戏。当你跑到目的地的时候，你可以在山上开着运输卡车，满载货物。在山上开车可以是令人兴奋和冒险的，因为你必须驾驶重型卡车沿山丘和危险的道路。注意在山路上慢慢行驶，不要让货物掉落，并避开周围的桅杆。小心颠簸和急转弯，因为它们会使负载从拖车上掉下来。展示你的驾驶和停车技能，把物品安全地运到目的地，而不是在路上掉下任何东西。携带重型货物安全通过现场，并停车您的卡车完成游戏。玩2018年最好的驾驶游戏。许多货物项目，如鼓，木托盘和气瓶等。作为一名小型货车司机，你必须妥善保管行李。使用离合器要小心不然可能损坏齿轮。当你完成任务后，你就可以开起重卡车了。努力工作，尽你最大的努力成为道路之王。记住永远不要过载，它会增加失败的几率。挑战大师。不要害怕。人无完人，他也不是最完美的。你开重型卡车。给军队送补给品。游戏轨道是实时保存的，所以不要担心忘记保存它们。享受货运卡车游戏，它会给你比其他卡车驾驶游戏更现实的经验。其特点包括 不同车型 卡车定制 真实物理环境 简单的操作","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Zombie Death Hunter 3D","slug":"zombie-death-hunter-3d","date":"2019-05-02T02:17:08.000Z","updated":"2019-05-05T03:54:49.621Z","comments":true,"path":"zombie-death-hunter-3d/","link":"","permalink":"http://localhost:4000/zombie-death-hunter-3d/","excerpt":"","text":"Zombie Death Hunter 3DA virus unlike anything we’ve seen before has spread like wildfire around the city. Everyday people going about their business have been transformed into creatures that will kill any living thing they come across. Survivors have fled, hoping to escape, but this is now a city of the dead. Those lucky enough to still be alive are hidden in warehouses, supermarkets or anywhere else they can find, waiting to be rescued.Game Features： An immersive first-person 3D adventure blending stunning graphics, excellent music and realistic sound effects to create a highly detailed world. Over 16 classic weapons to choose from including Crossbow, P90, Katana and Dragunov. Every weapon has been realistically recreated and each has a unique feel and performance. Multiple Zombie enemies to challenge your skills. The hordes of undead will keep you on your toes and your finger on the trigger. Smooth, intuitive controls allow you to navigate the city with ease. Precision aiming will help you take down zombies and rack up kill streaks. 僵尸射击大战-末日来临前所未见的病毒像滴入水面的染料般疯狂侵蚀着整个城市，曾经善良的市民被腐蚀成暴躁的僵尸猎杀着一切活着的生物。幸存者们四散而逃直到无路可退，他们绝望地躲进封闭的超市或者废弃仓库，等待着救援。拿起你的狙击枪反击吧！ 游戏采用了第一人称视角进行射击游戏，游戏中僵尸造型逼真，游戏环境十分恐怖哦，玩家在游戏中需要时刻小心哦，小心被僵尸吓一跳，喜欢的玩家一定不要错过哦！ 游戏特色1、全3D效果 打造高清视觉盛宴——僵尸、角色、场景，全3D倾力制作，真实音画完美相融，打造身临其境的绝佳第一视角射击游戏。2、百种武器 史上最牛武器装备——几十把武器依据真实数据还原，带给您最真实的射击体验。3、成群僵尸 还原真实扫射快感——成群结队的僵尸将满足您的扫射本能，而强大的变异僵尸却是对您操作的究极考验。4、极简操作 感受最佳射击体验——高度优化的操作让您更容易控制您的角色，避免了常规双摇杆的繁杂操作，让您体验枪枪爆头的快感。","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Flow Dash","slug":"flow-dash","date":"2019-05-02T02:15:34.000Z","updated":"2019-05-05T03:50:47.710Z","comments":true,"path":"flow-dash/","link":"","permalink":"http://localhost:4000/flow-dash/","excerpt":"","text":"Flow Dash“Flow Dash” is a minimalistic &amp; casual puzzle game where players need to connect their circuits in the game to make the circuit run successfully. Gameplay: Click on the switch in the middle to push the current out. The player needs to turn the rotatable wire ahead of time, arrange a reasonable route, direct the current to the electronic component, and let the current flow before reaching the gear. Game features 50 levels in all. Concise images Somehow test the players’ physics knowledge Easy to get start 电流冲刺“电流冲刺”是一款休闲益智手游，玩家在游戏中需要自己来把电路连接起来，使电路能够成功运转。 游戏玩法: 点击中间的开关将射出电流向前突进，玩家需要提前转动可旋转的导线，安排合理的路线，将电流引至电子原件，并且要使电流在到达齿轮之前完成。 游戏特色-丰富的游戏关卡,共有50个关卡-简洁的游戏画风-非常考验玩家的物理知识-简单的游戏玩法","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Volume Pass","slug":"volume-pass","date":"2019-05-02T02:14:00.000Z","updated":"2019-05-05T03:20:12.747Z","comments":true,"path":"volume-pass/","link":"","permalink":"http://localhost:4000/volume-pass/","excerpt":"","text":"Volume PassMake rush geometry volume shape or color fit the gate ‘s one and across them! Volume Pass is an agile category of parkour casual 3D games. In the game, the player needs to control the volume body through various forms of door frames. Depending on the game mode, the volume body needs to change colors or change shapes before passing the door frame successfully, so as to be consistent with the color or frame hole of the door frame. The game level is endless mode, keep alive longer, through the more door frames, and the higher the score you will get. So guys, come and give a try! How to play: Tap the screen to switch the shape or color 立方穿越立方穿越是一款敏捷类的跑酷休闲3D游戏。游戏中玩家需要控制立方体积通过各种不同形式的门框，根据游戏模式的不同，立方体积在成功通过门框之前需要改变颜色或者改变形状，从而与门框的颜色或者框洞形状保持一致。游戏关卡为无尽模式，坚持的时间越长，通过的门框越多，分数也就越高。那么小伙们，快来挑战你的高分吧。 游戏玩法： 点击屏幕切换立方体积形状或者颜色","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Shooting Strike 3D","slug":"shooting-strike-3d","date":"2019-05-02T02:10:50.000Z","updated":"2019-05-05T03:53:49.909Z","comments":true,"path":"shooting-strike-3d/","link":"","permalink":"http://localhost:4000/shooting-strike-3d/","excerpt":"","text":"SHOOTING STRIKE 3DSHOOTING STRIKE 3D is an advanced and thrilling anti-terror shooting game. Here is full of classic but powerful weapons, classic but gorgious battlefields. As well as the best of the Armed Forces. You must fight with courage and determination. mission accomplished. Become a anti-terror police hero. Game control: Virtual joystick of left screen for moving, right screen spare area for aiming When you aim the target,your weapon will fire automatically,giving you a much easier FPS game control. You can prepare your bullets before battling,or auto buy bullet in the battle. Game tips Auto shooting,you only need to do is to place the crosshair on the target,the best way to play FPS on portable devices. You can tweak your control sensivity in your pause menu Auto buying bullets in the battle,save your precious time 警察反恐行动警察反恐行动是一款高级而惊心动魄的反恐射击游戏。这里充满了经典而又强大的武器，经典而又充满战斗力的战场。以及最好的武装部队。你必须勇敢和坚定地战斗，并且完成任务。最终成为反恐警察英雄。 游戏控制： 左屏幕虚拟摇杆用于移动，右屏幕空闲区域用于瞄准 当你瞄准目标时，你的武器会自动射击，为你提供更容易的第一人称视角的游戏控制。 你可以在战斗前准备你的子弹，或者在战斗中自动购买子弹。 游戏提示 自动射击，你只需要将十字准线瞄准在目标上，这是在移动设备上玩FPS游戏的最佳方式。 你可以在暂停菜单中调整你的控制灵敏度 在战斗中自动购买子弹，节省您宝贵的时间","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Real Coach Bus Simulator 3D","slug":"real-coach-bus-simulator-3d","date":"2019-05-02T02:09:16.000Z","updated":"2019-05-05T03:52:50.045Z","comments":true,"path":"real-coach-bus-simulator-3d/","link":"","permalink":"http://localhost:4000/real-coach-bus-simulator-3d/","excerpt":"","text":"Real Coach Bus Simulator 3D‘Real Coach Bus Simulator 3D’ is a coach driving simulate game that will teach you drive a real coach across different scenarios! Take people from a city to another, show them amazing places and landscapes. Open world map, incredible vehicles, wonderful interiors will make you feel a realistic coach bus driving experience! It’s time to get on board and drive through the whole country! Enter the simulation world of bus driving! Get ‘Real Coach Bus Simulator 3D’ now! Features: Open World Map Detailed Coach buses Help other coaches across the route Animated people entering/exiting the bus Weather conditions and day night cycle Realistic visual damage Steering Wheel, Buttons, Tilting and the awesome real mode with clutch Detailed Interiors Intelligent Traffic System 真实公交车模拟3D‘真实公交车模拟3D’是一款公交车驾驶模拟游戏，您将有机会体验作为公交车司机将会经历的各种场景，并成为一个真正的公交车司机！逼真的开放式地图，令人难以置信的车辆，精彩的内饰会让你感觉像驾驶一辆真正的大巴！现在是时候上车并驾驶一辆公交车来完成所有的交通路线！下载‘真实公交车模拟3D’吧！这是一款能够让你体验一名真正公交车司机的游戏！ 游戏特色：-开放的地图设计-多种客车大巴-真实的物理模拟-较为逼真的乘客上下车动画表现-较为真实的天气变化以及白天黑夜交替-较为真实的破损表现-方向盘、按键、离合器都为真实模拟-详细的车内装饰-智能的交通系统","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Real Truck Cargo Transport 3D","slug":"real-truck-cargo","date":"2019-05-02T02:07:21.000Z","updated":"2019-05-05T03:53:11.316Z","comments":true,"path":"real-truck-cargo/","link":"","permalink":"http://localhost:4000/real-truck-cargo/","excerpt":"","text":"Real Truck Cargo Transport 3DBecome a truck driver in this expansive open world truck driver simulator.Start from the bottom and work your company to the top. You start with a classic venerable truck.Deliver trailers and earn money, upgrade your truck or buy more modern trucks.If you are not into semi trucks, there is also a variety of Light Trucks. The choice is yours. Features: Detailed truck models Fully modeled interiors for each truck A lot of upgrades for each truck Dynamic day &amp; night Many different trailer options with different weights and sizes Frequent updates add new content and vehicles Different control options (buttons, tilt, sliders or steering wheel) Manual and automatic gearbox options Realistic physics Different road types Massive open world without loading screens Realistic engine sounds Lively AI traffic system 真实卡车运输3D这是一款模拟运输游戏。游戏中玩家需要驾驶美式卡车运输货物，过程中要保证遵守交通规则，保持匀速行驶，按时交货等等，还要靠自己的驾驶技术把货车精确的停到货仓。 在游戏中驾驶一辆大卡车可能不容易，因为它看起来简单， 但是您必须是停车卡专家才能将包裹运送到正确的位置。从一个城市到另一个城市的大路上开车。在美丽的欧洲乡村，危险的高山和丘陵环境以及绿色农场驾驶您的卡车。 游戏特点： 现实的交通环境 许多货物转移任务 不同的卡车可供选择 逼真的卡车物理 惊人的3D图形 逼真的游戏声音效果 简单的方向盘，按钮或倾斜控制","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Traffic Turbo Drift","slug":"traffic-turbo-drift","date":"2019-05-02T02:05:09.000Z","updated":"2019-05-02T15:39:38.470Z","comments":true,"path":"traffic-turbo-drift/","link":"","permalink":"http://localhost:4000/traffic-turbo-drift/","excerpt":"","text":"Traffic Turbo DriftWelcome to the most exciting car racing game - Traffic Turbo Drift. Dangerous streets and marvelous stunts combine to form this popular car racing game. As a best stunt driver, you are supposed to challenge rough highway. Learn to dodge traffic jams. Perfect your drifting skills and win all races. No speed limits and variety of tracks are available to choose. Now, the wheels of the car began to turn. Are you ready to show your marvelous drifting skills on impossible road?Traffic Turbo Drift extreme highway cars drifting master is the best freestyle car game with a realistic feel. Grab your awesome car and prove you are a true city traffic ride and drifter. Be a best car racer on a whole city for you. Choose your drift car, customize it and start drifting. Pick best camera view and change how you view the track, either from outside your car or inside. If you like turbo car racing game, this car drift is best choice game of 2018. Ride into the city streets roads at the speed of lightening the riding free! Realistic drift master. Super-charged action packed car racing master simulator go for the victory and improve your car racing experience. Hugely open world driving simulator with city Miles of roads to drift and drive on the beautiful city tracks. enjoy the latest car drifting game with super features and best control. Get ready for the most furious and thundering race competitions. Lots of racing car rivals, new cars and some exceptional traditions are ready to be introduced in gaming zone. Real life city environment, real traffic, real crashes, stunning collisions and impact-crash sounds are ensured for an exciting car racing 2018.Select top cars for the drift racing and extreme car drive around the New York City in Traffic Turbo Drift. Be ready for this pull drive simulator with best of extreme car driving 2019. Experience the most realistic car driving simulation game, speed past civilian vehicles and drift around city and open car parks. Start the destruction with partner for gaining maximum scores to unlock more sports cars. Become extreme speed stunts hero and impossible car stunt racing professional driver on the stunt car tracks 3D with racing in highway car 2019 city traffic top racer.Play this racing and speed drifting simulator. Remember one thing! the better your time, the higher your chances for greater rewards that in turn unlock new cars to drive and park. Upgrade your wheels and engines. Go for Traffic Turbo Drift. Race, jump and drift around the downtown. Driving on every dangerous streets. Perform ultimate stunts and tricks against your opponent. Conquer every tracks. You are the king of road! Perfect Drift Track Street Drift Mania Real racing drift Simple and smooth control Stunning visual effects Highly realistic drift game High speed drift racing mode Win on Drift Road Highly graphics 街道极速漂移一个优秀车手的艰难的终极挑战：城市公路极速驾驶模拟欢迎来到最激动人心的赛车游戏-街道极速漂移。危险的街道和绝妙的特技结合在一起，形成了这款流行的赛车游戏。作为一个最好的特技车手，你应该挑战崎岖的公路。学会避开交通堵塞。完美漂移技巧，赢得所有比赛。没有速度限制，各种轨道可供选择。现在，汽车的轮子开始转动。你准备好在不可能的道路上展示你非凡的漂流技巧了吗？交通涡轮漂移极限高速公路车辆漂移大师是最好的自由式赛车游戏与现实的感觉。抓住你的好车，并证明你是一个真正的城市交通骑和漂流者。在整个城市里为你做一个最好的赛车手。选择你的漂流车，定制它并开始漂流。选择最好的相机视角，改变你对赛道的看法，无论是从车外还是车内。如果你喜欢涡轮赛车游戏，这个赛车漂移是2018年最好的选择游戏。乘车进入城市街道，道路以闪电的速度自由行驶！现实漂移大师。超级充电的行动包装赛车主模拟器去争取胜利，并提高您的赛车经验。巨大的开放世界驾驶模拟器与城市英里的道路漂流和行驶在美丽的城市轨道上。享受最新的汽车漂流游戏与超级功能和最佳控制。为最激烈和最雷鸣的比赛做好准备。许多赛车竞争对手，新车和一些特殊的传统，准备在游戏区推出。真实的城市环境，真实的交通，真实的碰撞，惊人的碰撞和碰撞的声音，确保了令人兴奋的2018年赛车。在交通涡轮极速漂移中，为漂流赛车和在纽约市周围行驶的极限汽车选择顶级汽车。准备好这个拉力驾驶模拟器与最好的极限汽车驾驶2019年。体验最真实的汽车驾驶模拟游戏，速度超过民用车辆和漂流城市和开放停车场。开始破坏与合作伙伴，以获得最大的分数，以解锁更多的跑车。成为极速特技英雄和不可能的汽车特技赛车专业车手在特技车轨道三维与赛车在高速公路，2019年城市交通顶级赛车手。玩这个赛车和速度漂移模拟器。记住一件事！你的时间越长，你获得更多奖励的机会就越大，而这些奖励反过来又会解锁新车供你驾驶和停车。升级你的车轮和引擎。进入交通涡轮漂移。在市中心比赛，跳跃和漂流。在每条危险的街道上开车。展现终极的特技和技巧击败你的对手。征服所有的赛道。你是道路之王！-完美漂移赛道-街头极速狂飙-真正的赛车漂移-简单而流畅的控制-惊人的视觉效果-高度现实漂移游戏-高速漂移赛车模式-在漂移道路上获胜-高度图形","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Hill Climb Bus Racing 3D","slug":"hill-climb-bus-racing-3d","date":"2019-05-02T01:59:08.000Z","updated":"2019-05-05T03:51:07.070Z","comments":true,"path":"hill-climb-bus-racing-3d/","link":"","permalink":"http://localhost:4000/hill-climb-bus-racing-3d/","excerpt":"","text":"Hill Climb Bus Racing 3DHill Climb Bus Racing 3D brings you the best bus racing experience. Racing on the streets has ended. Its time to race on Hill Climb Tracks. You’ll need to master the art of control, balance, speed and drift if you want to reach the finish line on these hill climb tracks. Hill Climb Bus Racing 3D offers a real-time multiplayer, race against your friend or against a random opponent. Its time to get on the driving chair and prove your driving skills. Driving a Bus is difficult but Racing a Bus is much more challenging. Race through hill climb, dangerous obstacles, curvy, hilly, steep mountain road and reach your destination, sometimes you may meet a giant downhill slope in this game. The harsh truth is that if you take this seriously, you will be lost. A very smooth gameplay brings you the real experience of driving and racing a bus. you will feel nonstop. Remember that there are passenges on the bus ,please make them feel very safe, just like lay on the hull in a peace sea.And when you are driving the bus and climbing the hill, you need to pay more attention to the accelerometer, if the accelerometer is zero, that will be dangerous. Realistic 3D environment brings more life to the game, 3 different themes to play, and lots of buses including omnibus to upgrade. Start the extreme racing experience and perform insane driving control on some of the most difficult hill climb tracks. Hill Climb Bus Racing 3D Features : Free to Play! 3D Realistic maps &amp; HD graphics Incredible vehicles Wonderful Interiors Multiple controls, Steering Wheel, Buttons or Tilting Intelligent Traffic System Challenge your friends with realtime multiplayer 3D Environment Single Player and multiplayer Mode 爬山巴士赛车3D爬山巴士赛车3D将会带给你最好的巴士赛车体验。街上的巴士模拟已经不好玩了，现在是在狭窄的山道上爬山比赛。你需要掌握控制、平衡、速度和漂移的艺术，如果你想达到这些山坡攀山峰的终点。 爬山巴士赛车3D提供了一个实时的多人游戏，你可以与您的朋友或随机对手进行比赛。现在坐上驾驶椅，证明你的驾驶技术了。我们知道驾驶公共汽车是困难的，但驾驶公共汽车进行竞速爬坡比赛是更具挑战性。 比赛通过爬山，危险的障碍，弯曲，丘陵，陡峭的山路，并达到您的目的地。有时候你会在这个游戏中遇到一个巨大的下坡，稍有不慎，你就会挑战失败，跌落悬崖。 请记住，车上有旅客，你需要让他们感到很安全，就像躺在平静的海面上。当你在驾驶公共汽车和爬山的时候，你需要更加注意加速表，如果加速度计是零，那将是危险的。 现实的3D环境为游戏带来了更多的活力，3个不同的主题可以玩，还有包括公共汽车在内的很多公交车可以升级。 现在让我们开始极限赛车体验，并且驾驶公共汽车进行竞速爬坡比赛吧。 爬山巴士赛车3D特色： 完全免费玩！ 三维真实感地图和高清图形 不可思议的车辆 ——美妙的室内装饰 转向盘、按钮或倾斜的多重控制 智能交通系统 用实时多人游戏挑战你的朋友 单人和多人游戏模式","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Happy Real Bowling 3D","slug":"happy-real-bowling-3d","date":"2019-05-02T01:57:15.000Z","updated":"2019-05-05T04:09:48.477Z","comments":true,"path":"happy-real-bowling-3d/","link":"","permalink":"http://localhost:4000/happy-real-bowling-3d/","excerpt":"","text":"Happy Real Bowling 3DHappy Real Bowling 3D is an ace and joyful bowling game available for smart phones. Multiple balls available to hit pin. Tilt or swipe your finger to control the ball. The major thing for player is to knock down all the pins with one or two balls. Fair weather, a lot of teams gather in square, prepare for the tournament. Join in it, get more points, I am sure your impressive performance will shock everyone. So are you ready to start a professional career?This 3D bowling games have high definition 3D graphics and joyful bowling alleys around the world, you should become strong to unlock it. You will enjoy the impressive graphics. Besides, our games set up 1 vs 1 mode, abundant tournaments and World Championship are held on American. which means the last second is the teammate, the next is the opponent. Through the competition , you can win millions of chips.The ace mobile games have different functions of balls, such as split balls and bomb balls. The major task in bowling challenge is to knock down all the pins with one or two balls. Add it and held your ball tightly , you will understand. In order to bring unique gaming experience. We also have all kinds of balls- Pluto Mars and more ,may be earth. Life is full of surprises. We also set up surprise mode , if your scores is dual, you will win the surprising challenges.Impressive graphics and abundant immersive bowls are the advantages of this 3d bowling game. team up with your friends to participate in different bowling challenge. A wide range of colour and patterns are available. It is time to start a joyful adventure! You will like it. Game features include: Four opponents of increasing difficulty Realistic physics Adjustable curve balls Score history Resume game 欢乐保龄球3D欢乐保龄球3D是一个极好的和有趣的保龄球游戏，可用于智能移动设备。多个球可打销。倾斜或滑动你的手指来控制球。对球员来说，最重要的是用一两个球打倒所有的球瓶。天气晴朗，很多球队聚集在广场上，为比赛做准备。加入它，得到更多的分数，我相信你令人印象深刻的表现将震惊每个人。你准备好开始职业生涯了吗？我们的游戏有高清的3D画面和来自世界各地的神秘的保龄球道，只有成为强者才能解锁，然后你会尽情享受迷人的场景。此外，我们的游戏设置了1对1模式，以及数十个锦标赛。这也就意味着上一秒是队友，下一秒是对手。通过竞争，你可以赢得数百万的筹码。我们的游戏有球不同的的功能，比如分裂球和炸弹球，加上游戏，你就会明白了。为了创造独特的游戏体验…我们也有各种各样的球-冥王星，火星和更多，也可能是地球。生活充满了惊喜。我们还设置了惊喜模式，如果你的分数是偶数，你将赢得惊喜的大奖。高清晰度图形是这个游戏的优势。但一些高难度关卡和优秀的对手是游戏的特点和挑战。世界锦标赛汇集了这场比赛中最好的玩家。当然，我们有专业的记分员，也许你可以骗过对手。但不能迷惑它们。同时，有时用投球器投球是困难的，多练习你就能做到。慢慢成为一名优秀的球员。 游戏特性：-增加难度的四个对手-现实物理-可调曲线球-得分历史-复赛","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Logic Blok","slug":"logic-blok","date":"2019-05-02T01:54:54.000Z","updated":"2019-05-05T03:51:29.646Z","comments":true,"path":"logic-blok/","link":"","permalink":"http://localhost:4000/logic-blok/","excerpt":"","text":"Logic BlokLogic Blok is a brain using puzzle game. In this game, you need to move the white color block above the grey color grid tiles platform reasonably, find the right road, and make it drop and pass through the green color slot hole. The less move steps the higher score! There are 14 interesting levels included. Each level build with different scene and buildings. As you move advance, the level will become harder and harder. The puzzle could not be resolved not so easy. The shortest road to the green target tile not aways as straight as the line, it will become zigzag. Drag the cube ahead some steps, and then roll it on other direction, because you also need to find the right dirction to make the white blok fit the hole perfectly. Any way some levels may ruined your mind so much. I think you could fix it out easily after try several times. Be patient, you will find out your solution. So guys, come and give a try, and see how less moves you could used to complete the levels? And enjoy the game! Game Features: click and drag on the screen to move the blok intuitive control and easy to get start amazing level design Beautiful HD Graphics Good music 智力立方“智力立方”是一款烧脑的益智解谜游戏。在游戏中，你需要对白色的立方体在灰色的网格迷宫中作合理的移动，找出到达终点的正确道路，并让其穿过平台上绿色的槽孔顺利坠落。过程中移动的步数越少得分越高。 游戏共有14个有趣的关卡。每个关卡都有不同的场景和建筑物。随着您游戏的进行，关卡的难度越来越大。有些谜题就不是那么容易就能解决的了。达到目标终点的道路将不再是直线路径，有时您不得不迂回前进。拖动白色方块向前移动几步，然后折回来滚动几下以调整正确的移动方向。为了使白色立方体完美契合绿颜色的槽孔，你不得不这样调整入孔方向。 游戏中某些关卡确实会有点烧脑。反复多尝试几次后，以你的智慧肯定能搞定的。有点耐心，解谜方法总是有的。 那么喜欢这类游戏的小伙伴们快来试试吧？看看你们能以最少多少步就完成关卡挑战。希望好好享受游戏。 游戏特色: 点击并拖拽来移动方块 操作直观，容易上手 不错的关卡设计 美轮美奂的图形表现 好听的背景音乐","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Stunt Bike Racer 3D : Impossible Rider","slug":"stunt-bike-racer-3d-impossible-rider","date":"2019-05-02T01:51:10.000Z","updated":"2019-05-02T15:39:16.101Z","comments":true,"path":"stunt-bike-racer-3d-impossible-rider/","link":"","permalink":"http://localhost:4000/stunt-bike-racer-3d-impossible-rider/","excerpt":"","text":"Stunt Bike Racer 3D : Impossible RiderExperience the ultimate skill-based bike racing game on your mobile devices. Ride your motorcycles on extremely addictive tracks while you perform slick wheelies, crazy jumps, mid-air flips and menacing stunts! “Stunt Bike Racer 3D : Impossible Rider” brings you experience of extreme motorbike rider. Ride your Bikes through curvy paths on amazing desert roads, mountain off road , and city roads but be careful on dangerous turns in bike racer. Experience the excitement and thrill of driving a dirt motorbike through a massive stadium, filled with bumps and jumps. Prove that you are the best moto auto champion and climb to the top of the leader boards. Ever dream of becoming a moto stunt rider? hey rookie! dust off your trail bike and join the ‘stunt bike racer 3d’ game. go for speed racing adventure like a crazy pilot flying car over city streets. feel the urge to drive fast and furious in off-road racing mania. This game bring you the exciting and fun-filled motocross game to become the ultimate roadster. Burn tires on asphalt tracks and blow off dirt in off-road terrain. if you love racing bike games then this moto race simulator is best for you. Game Features : physics-based game-play that feels just right. Lots of Amazing Racing vehicles bumpy rides with extreme obstacles Amazing 3D Environments with desert themes massive open world environment &amp; incredible stunt arena Fast racing tracks with tricky obstacles addictive game-play Very easy to get start 空中特技摩托3D : 不可能的飞车摩托车表演赛时驾驶你的摩托车，在令人惊叹的赛道上表演吧，这是常人所不能及的魔力表演。在空中翻滚，跨越到摩托所能达到的最高点。人人都喜欢享受骑摩托带来的自由和快感，这里，你可以通过高难度的动作感受下骑摩托的刺激。 “空中特技摩托3D : 不可能的飞车”为您带来作为一名极限摩托车骑手的体验。 在沙漠道路、越野山路和城市道路上骑着摩托车穿过弯曲的小路，同时注意赛道上突然的危险转弯。 体验那种飞跃一个巨大的体育场的兴奋，以及驾驶一辆摩托车在充满颠簸和跳跃的泥土赛道上的刺激。向大家证明你是最棒的特技摩托车车手冠军，并攀登比赛排行榜的顶端。 快来体验带给您的无限快感吧，你懂的！ 游戏特色： 多个可开启的摩托车 闯关解锁游戏模式 绝佳画面表现 基于真实物理模拟 细致、有趣的沙漠主题赛道环境、比赛场地 充满棘手障碍的快速赛道 真实再现车辆、环境与赛道间的精彩互动 操作直观容易入手 精美的3d图像表现","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Badminton World Champion 2018","slug":"badminton-world-champion-2018","date":"2019-05-02T01:44:11.000Z","updated":"2019-05-05T03:50:06.190Z","comments":true,"path":"badminton-world-champion-2018/","link":"","permalink":"http://localhost:4000/badminton-world-champion-2018/","excerpt":"","text":"Badminton World Champion 2018Compete with badminton players from all over the world and smash to competitor! Badminton is one of the most popular sports game in the world! In Crazy Badminton, compete with badminton players from all over the world! Do a crazy smash to your competitor! Take on your friends in 1 vs 1 mode, or win the Badminton League trophy in Tournament Mode!Customizing your character with tons of items. And level up your ability to do stronger smash and jump!Now grab your racket to smash, hit the shuttlecock, do a crazy smash to your opponent like badminton star!Also there are many sympathetic audience cheering for you.Also you can learn some tips from the game,such as Shuttle Run. The purpose of the shuttle run is to move to the different areas of the court while playing. You do not need to use a racket for this exercise.You will always end with your racket foot. After picking up each shuttle, return to the center. This exercise teaches you to have a ‘feeling’ of where you are on the court based on the number of steps you are taking.It also develops your fitness on court. Remember to always cross the center. Game Features: Multiple game modes available, play with sports fans in local Create your very own character, and level - up Easy to control, challenging to win Simple and elegant UI design Cool stunts and realistic hitting shuttlecock experience Numerous gorgeous badminton outfits 羽毛球世界冠军赛2018羽毛球世界冠军赛:找准落脚点,轻轻点击屏幕即可让主角将球拍过球网，规则与现实生活中的羽毛球赛事一样 这是一款画面精美的体育竞技类羽毛球游戏。在游戏中，玩家只需找准落脚点，轻轻点击屏幕即可让主角将球拍过球网，规则与现实生活中的羽毛球赛事一样。 真实的比赛体验搭配各种炫酷的击球方式，让羽毛球赛在手机上也能畅快地进行！ 游戏拥有多种不同的游戏模式，你可以在普通模式中通过单打或者双打来赚取金币，也可以在练习模式中提升自己的技巧，还有锦标赛模式、多人模式让你可以和其他玩家进行比拼。 游戏支持定制自己的角色，你还可以通过在商店购买球拍，鞋子，服装等道具来让自己的角色变得更强，喜欢羽毛球的玩家不妨来下载试试吧！ 游戏特色：1、玩法模式多样化；2、精致细腻的游戏画面；3、丰富多彩的游戏玩法；","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Fury Garage Car Driving 3D","slug":"fury-garage-car-driving-3d","date":"2019-05-02T01:34:19.000Z","updated":"2019-05-02T16:06:20.338Z","comments":true,"path":"fury-garage-car-driving-3d/","link":"","permalink":"http://localhost:4000/fury-garage-car-driving-3d/","excerpt":"","text":"Fury Garage Car Driving 3DWhether you are a driving learner, or a car driver, or you want to improve parking skills, i believe you will deeply love this game. The game simulates a variety of classic and practical parking zone, the image is clear and concise, and each level has been carefully designed.You will find the control feeling is very realistic, and it is easy to play: parking the car into the target position. ‘Fury Garage Car Driving 3D’ is a realistic parking simulated games. Drive various cars each with an unique behavoir. Discover lots of varied missions in a completely physical simulated world. We bring to you the ultimate driving simulator, in which you’ve to now drive and follow all the road signs.Don’t take the wrong turns, follow the signals, wear the seat belt – It’s your one stop to becoming a perfect driver. Game Features: huge parking lot, with beautiful shiny cars parked high quality physical environment different camera views physically calculated and detailed cars lots of varied missions realistic driving mechanics many shiny cars to choose from easy to learn and drive stunning 3d graphics 趣味车库停车3D如果你是一个需要在城市街道驾驶汽车的司机或者爱好者，尝试寻找真正的城市汽车驾驶、停车模拟器，那么你可以下载试试这个免费的经典停车游戏。 这款趣味停车模拟3D游戏实际上是停车场和驾驶模拟器的最佳混合体。 游戏开始时的任务简单，例如将车辆停放在正确的位置，而不会妨碍您的任何路径上障碍。但随着你的深入了解，任务变得越来越困难，达到目标变得更加具有挑战性。 你是否期待有一个新的停车模拟游戏可以让你反复练习停车？那么，趣味停车模拟3D就是您的菜了！学习如何在现实停车环境中导航、各种停车技巧、以及 停放车辆过程中尽量不要撞到周围物体。 ‘趣味车库停车3D’是一款逼真的停车模拟游戏。游戏中，您将驾驶各种各样的具有独特性能的汽车，在完全物理模拟世界中发现并完成各种不同的任务：驾驶基于物理计算的独特汽车在美丽的城市和建筑环境中把车停泊到指定的地点，记住： 驾驶以及停泊汽车过程中不要碰撞到其他车辆和物体。 游戏特色： 现实逼真的驾驶和停车经验 高品质的物理环境 操控简单直观 美丽的城市和建筑环境 开始关很容易、随着关卡的推进，游戏变得更有挑战性 解锁其他车型 各种挑战性的使命 各种相机角度 障碍数量，使玩家可以尝试在各种路况下停止体验","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Apocalypse Runner","slug":"apocalypse-runner","date":"2019-05-02T01:23:35.000Z","updated":"2019-05-02T05:53:48.221Z","comments":true,"path":"apocalypse-runner/","link":"","permalink":"http://localhost:4000/apocalypse-runner/","excerpt":"","text":"Apocalypse RunnerIn the game you are fleeing from the impending huge wave. You have to use every opportunity to not become a victim. Run along the rocky platforms, overcome obstacles, collect bonuses, earn points and compare them with the points of other players. Atmospheric setting Addictive gameplay Simple control Built-in online-record table 绝地逃亡绝地逃亡是一款休闲类街机游戏，在游戏中你要从即将到来的巨浪中逃离。你要利用一切机会，不然就会变成牺牲品。沿着岩石一直跑下去，克服障碍，收集奖金，赚取积分，并与其他玩家的分数进行比较。 大气环境 易容上瘾的游戏 简单的操控 内置在线积分记录","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Physics Ball: Balance Challenge","slug":"physics-ball","date":"2019-04-26T10:19:27.000Z","updated":"2019-05-02T15:38:25.350Z","comments":true,"path":"physics-ball/","link":"","permalink":"http://localhost:4000/physics-ball/","excerpt":"","text":"Physics Ball: Balance ChallengeIn Physics Ball: Balance Challenge game, you are to operate a ball, simultaneously keeping its balance. It is not so easy: your way runs over the clouds across narrow roads and air tracks or something like unconnected sky bridges. React fast, don’t cross the edges of the field, lest you should slide down to the chasm! Intermediate results are saved by the checkpoints automatically - if you fall it will bring you to the last check point. Every new stage will bring you new challenges: steep slopes and bends, dangerous areas, barriers - there is no time for boredom. Each level built with high level graphics quality, you could explore the world with camera zoom in/out view operation, and see more details.Be attentive and patient, and you will succeed in winning the game at the end! How to play: easy to get start great colorful HD graphics addictive game play various and amazing game levels slide the left screen to roll ball slide the right screen to tune the view camera angle 物理平衡球在物理平衡球游戏中，您需要滚动一个平衡球，同时保持其平衡。这不是听起来那么容易：你需要操作它穿过云层上狭窄的空中栈道或者是没有相互连接在一起的天桥。快速反应，不要让天空之球越过轨道的边缘，否则你会滑落峡谷深处！游戏中间过程会在检查点自动保存 - 如果您失败了它会将您到最后一个检查点重新开始。这是一场考验您反应力的大挑战！ 每一个关卡都会带给你新的挑战：更加陡峭的山坡和弯道，更加危险的地区，更多障碍 - 你根本没有时间闲得无聊。同时，每个关卡都是高清图形画质，您可以通过摄像机视角放大/缩小操作来探索世界，看到场景的更多细节。 需要有细心和耐心，您最终会挑战成功赢得比赛！ 游戏玩法: 操作简单容易上手 非常棒的画面表现 容易上瘾的游戏玩法 许多有趣的关卡 滑动左屏幕来滚动球 滑动右侧屏幕来调整摄像机视图","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Neon City","slug":"neon.city","date":"2019-04-23T14:44:03.000Z","updated":"2019-04-26T09:57:24.929Z","comments":true,"path":"neon.city/","link":"","permalink":"http://localhost:4000/neon.city/","excerpt":"","text":"Neon CityIn this game you will experience yourself as a racing pilot of a space fighter. Controlling them using the accelerometer, you have to hold out as long as possible on the road, that filled with a variety of obstacles! So get it and test how long you could fly.Features of the game: Quality HD graphics in the style of the famous film Tron Control by accelerometer Various blocks set up in level Endless game play mode Uploading high scores online 霓虹都市“霓虹都市”是一款灯光画面优美的赛车竞速类手机游戏。在这个游戏中，你将化身为一个驾驶太空战斗机飞驰的飞行员。这款游戏运用了著名的影片Tron的风格品质的高清显示，加速度感应控制飞机的方向。你需要巧妙躲过道路上的一切障碍，并尽可能飞驰更长的距离。你可以飞多远呢？来试试吧！ 游戏特色： 高清画质感，Tron电影风格； 加速感应控制 多种游戏道具帮你跑酷； 背景音乐震撼好听","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Death Pipe X","slug":"death.pipe.x","date":"2019-04-17T07:44:43.000Z","updated":"2019-04-26T09:56:51.764Z","comments":true,"path":"death.pipe.x/","link":"","permalink":"http://localhost:4000/death.pipe.x/","excerpt":"","text":"Death Pipe XSimple, easy to start, cute and dynamic timekiller. Surf with high speed along an endless tube filled with dangerous obstacles. Try to make alive as long as you can, dodging blocks and other whimsical constructions. The game score will be record automatically. You could upload your achievements and compete with other players. Colorful HD graphics Dynamic changing game play Endless game mode Collect game coins for trade interesting props Accelerometer control or screen touch Built-in score record and show off Performance fully compatible with some older devices 死亡管道X这是一款简单、易用、精致、用于打发时间的利器。游戏中你会沿一个充满危险障碍的无尽的管道上高速冲浪。你需要避开那些奇怪的、脑洞大开的障碍物，尽可能的持续更长时间。游戏将会自动记录比赛分数。你可以上传你的成绩来和其他玩家的成绩来比较。-高清画质图像-动态改变的游戏玩法-没有终结的游戏模式-可收集游戏货币，它用于交换有趣的道具-加速控制或触摸屏方式控制-内置得分记录，可以向其他玩家炫耀-性能完全兼容某些老的设备","categories":[{"name":"Game","slug":"Game","permalink":"http://localhost:4000/categories/Game/"}],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2019-04-17T04:00:17.947Z","updated":"2019-04-26T07:52:20.927Z","comments":true,"path":"hello-world/","link":"","permalink":"http://localhost:4000/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"Blog","slug":"Blog","permalink":"http://localhost:4000/categories/Blog/"}],"tags":[]}]}